[
  {
    "id": "soiree-anna-pavlovna",
    "title": "Вечер у Анны Павловны Шерер",
    "date": "1805-07-01",
    "placeId": "st-petersburg",
    "type": "salon",
    "participants": [
      "pierre-bezukhov",
      "andrei-bolkonsky",
      "helene-kuragina",
      "vasily-kuragin",
      "anna-scherer"
    ],
    "summary": "Вечер в салоне Анны Павловны Шерер становится символом лицемерия и искусственности светского общества, противопоставленного подлинным человеческим чувствам и народной жизни.",
    "detailed_description": "Вечер у фрейлины императрицы Анны Павловны Шерер собирает петербургскую аристократию для обсуждения политики, войны и придворных сплетен. Пьер Безухов впервые появляется в свете и сразу чувствует себя чужим среди условностей и лжи. Андрей Болконский, уже разочарованный в салонной жизни, смотрит на происходящее с иронией и скрытым презрением. Князь Василий и Элен демонстрируют цинизм и расчет, тогда как Анна Павловна олицетворяет сам механизм светского салона. Вечер задаёт тон критике высшего света и вводит большинство ключевых героев.",
    "quotes": [
      "– Eh bien, mon prince. Gênes et Lucques ne sont plus que des apanages, des поместья, de la famille Buonaparte…",
      "Он говорил на том изысканном французском языке, на котором не только говорили, но и думали наши деды…",
      "Анна Павловна приветствовала его поклоном, относящимся к людям самой низшей иерархии в ее салоне.",
      "Этот толстый молодой человек был незаконный сын знаменитого екатерининского вельможи, графа Безухова…",
      "Эта жизнь, которую вы так любите, – пустая, глупая, обманчивая…"
    ],
    "significance": "Ключевое вводное событие, задающее тон критике высшего света. Здесь завязываются линии Пьера, Андрея, Курагиных, демонстрируется разрыв между внешней политической риторикой и внутренней пустотой общества.",
    "themes": [
      "war-and-peace",
      "family-and-love",
      "russian-soul"
    ],
    "symbolism": "Салон как модель искусственного общества; французский язык как символ отрыва от национальных корней и народной жизни.",
    "historical_context": "Начало войны Третьей коалиции против Наполеона, казнь герцога Энгиенского; европейская политика обсуждается как салонная тема.",
    "character_development": "Пьер – наивность и искренность, впервые попадающие в мир светской игры; Андрей – усталость и разочарование в свете; Анна Шерер – воплощение придворной искусственности; Василий – циничный политический игрок.",
    "textLink": "1.1.1"
  },
  {
    "id": "pierre-inheritance",
    "title": "Неожиданное наследство Пьера Безухова",
    "date": "1805-11-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "pierre-bezukhov",
      "vasily-kuragin",
      "helene-kuragina"
    ],
    "summary": "Пьер неожиданно становится наследником огромного состояния, что резко меняет его социальный статус и провоцирует охоту за ним со стороны высшего света.",
    "detailed_description": "После тяжёлой болезни умирает граф Безухов. Пьер, до того считавшийся незаконным сыном и стоявший на обочине светской иерархии, официально признаётся наследником гигантского состояния. Петербургско‑московское общество мгновенно меняет к нему отношение: вчерашний неловкий юноша оказывается в центре всеобщего внимания. Князь Василий Курагин спешит воспользоваться ситуацией: интригами вокруг завещания и лестью Пьеру он добивается признания его наследником, а затем подводит к мысли о браке с Элен. Пьер чувствует растерянность и внутреннюю отчуждённость от этого праздника чужих для него интересов.",
    "quotes": [
      "Все бросились к нему. Одни поздравляли, другие выражали сожаление…",
      "Князь Василий был постоянно занят устройством дел своих детей…",
      "Пьер испытывал растерянность и неловкое удовольствие, но внутренне чувствовал чуждость всему происходящему."
    ],
    "significance": "Резкий социальный взлёт Пьера. Сюжетно открывает линию брака с Элен и всей последующей нравственной эволюции героя; тематически показывает зависимость светского отношения к человеку от его состояния и ранга.",
    "themes": [
      "social-climbing",
      "inheritance",
      "freedom-and-necessity"
    ],
    "symbolism": "Наследство как символ условности общественной ценности человека; богатство как источник несвободы и манипуляций.",
    "historical_context": "Начало XIX века, типичные для русского дворянства наследственные споры и придворное покровительство.",
    "character_development": "Пьер – переход из состояния 'лишнего' человека к статусу богатейшего вельможи, при сохранении внутренней неуверенности; Василий – демонстрация его цинизма и мастерства придворной интриги; Элен – будущая 'красивая невеста' без подлинного чувства.",
    "textLink": "1.1.5"
  },
  {
    "id": "pierre-marriage-to-helene",
    "title": "Женитьба Пьера Безухова на Элен Курагиной",
    "date": "1806-01-01",
    "placeId": "st-petersburg",
    "type": "personal",
    "participants": [
      "pierre-bezukhov",
      "helene-kuragina",
      "vasily-kuragin",
      "anna-scherer"
    ],
    "summary": "Пьер женится на Элен Курагиной под давлением князя Василия и всего светского круга. Брак оказывается внешне блестящим, но внутренне пустым и несчастливым.",
    "detailed_description": "Брак Пьера с Элен заключается стремительно: князь Василий умело манипулирует обстоятельствами, Анна Павловна и свет поддерживают 'естественность' союза богатейшего графа и главной красавицы. Пьер почти не успевает осознать случившееся: он смутно чувствует, что 'делает что‑то не то', но не обладает волей к сопротивлению. Свет лицемерно восхищается браком, одновременно недоумевая, 'как она могла выйти за такого человека'. Вскоре Пьер начинает ощущать духовную пустоту этого союза и своё внутреннее одиночество.",
    "quotes": [
      "Он чувствовал, что женат на прекраснейшей женщине света, и в то же время чувствовал, что страшно несчастлив…",
      "Все удивлялись, как она могла выйти за такого человека, как Пьер…",
      "Элен же демонстрировала холодное самодовольство и удовлетворение собственной выгодой."
    ],
    "significance": "Отправная точка нравственного кризиса Пьера. Событие вскрывает ложь светских браков по расчёту, противопоставляя внешнюю красоту и 'удачу' духовной опустошённости и несчастью обоих супругов.",
    "themes": [
      "marriage",
      "social-hypocrisy",
      "family-and-love",
      "faith-and-reason"
    ],
    "symbolism": "Брак как сделка; Элен – символ светской фальши и 'красивой пустоты'; Пьер – жертва и соучастник этого ложного союза.",
    "historical_context": "Типичный для дворянства начала XIX века брак по расчёту, санкционированный салонным обществом.",
    "character_development": "Пьер – вход в полосу внутреннего надлома, ведущего к дуэли, масонству и духовным поискам; Элен – утверждение как 'царицы света', для которой брак – инструмент положения; Василий – успешный интриган и 'устроитель' судеб детей.",
    "textLink": "2.1.12"
  },
  {
    "id": "moscow-fire", 
    "title": "Пожар Москвы",
    "date": "1812-09-14",
    "placeId": "moscow",
    "type": "disaster",
    "participants": [
      "pierre-bezukhov",
      "napoleon-bonaparte"
    ],
    "summary": "После оставления Москвы русскими войсками город охватывает пожар. Пьер Безухов остается в горящей Москве, где спасает ребенка и защищает армянскую семью от французских мародеров.",
    "quotes": [
      "Наполеон вступил в Москву, ожидая найти богатый город, но вместо этого нашел пустые улицы и горящие дома.",
      "Пьер Безухов, увидев пожар, понял, что должен помочь. Он бросился в огонь, чтобы спасти ребенка.",
      "Пламя бушевало, и дым заполнял воздух. Пьер кашлял, но не останавливался, пока не нашел ребенка в горящем доме.",
      "Москва горела с разных сторон, и ее жгли русские, чтобы ничего не доставалось неприятелю.",
      "Пожар Москвы стал символом народной войны и патриотического подъема москвичей."
    ],
    "significance": "Символизирует народный характер войны. Показывает разрушительные последствия войны и духовное преображение Пьера Безухова. Становится началом конца для наполеоновской армии."
  },
  {
    "id": "hunt-in-otradnoye",
    "title": "Охота в Отрадном",
    "date": "1806-09-01",
    "placeId": "otradnoye",
    "type": "social",
    "participants": [
      "natasha-rostova", 
      "nikolai-rostov",
      "andrei-bolkonsky"
    ],
    "summary": "Семейная охота Ростовых в их имении Отрадное. Андрей Болконский, гостящий у Ростовых, впервые по-настоящему замечает жизнерадостную Наташу.",
    "quotes": [
      "Охота в Отрадном была веселым мероприятием, где собрались друзья и семья Ростовых.",
      "Андрей Болконский, приехавший в гости, впервые по-настоящему заметил Наташу Ростову.",
      "Наташа, молодая и живая, сразу привлекла внимание Андрея своей искренностью и красотой.",
      "Андрей почувствовал, что между ними есть особая связь, которую он не мог объяснить.",
      "Дядюшке не нравилось, что на охоту взяли детей — Наташу и Петю."
    ],
    "significance": "Начало отношений между Андреем и Наташей. Показывает естественность и простоту жизни Ростовых в противовес искусственности светского общества."
  },
  {
    "id": "ball-in-st-petersburg", 
    "title": "Бал в Петербурге",
    "date": "1810-01-01",
    "placeId": "st-petersburg",
    "type": "ball",
    "participants": [
      "natasha-rostova",
      "andrei-bolkonsky", 
      "helene-kuragina"
    ],
    "summary": "Первый выход Наташи Ростовой в свет на большом балу. Андрей Болконский приглашает ее на танец, что знаменует начало их романа.",
    "quotes": [
      "Бал в Петербурге был роскошным мероприятием, где собрались самые знатные семьи.",
      "Наташа Ростова, в своем первом бальном платье, была очаровательна и привлекала внимание всех присутствующих.",
      "Андрей Болконский, увидев Наташу, почувствовал, что его сердце забилось чаще.",
      "Они танцевали вместе, и Андрей сказал: 'Вы сегодня прекрасны, мадемуазель.'",
      "Наташа ответила: 'Благодарю вас, князь. Я очень рада видеть вас здесь.'"
    ],
    "significance": "Решающий момент в развитии отношений Наташи и Андрея. Символизирует вхождение Наташи во взрослую жизнь. Показывает контраст между естественной красотой Наташи и искусственной красотой Элен."
  },
  {
    "id": "retreat-from-moscow",
    "title": "Отступление французской армии из Москвы", 
    "date": "1812-10-19",
    "placeId": "moscow",
    "type": "military",
    "participants": [
      "pierre-bezukhov",
      "napoleon-bonaparte",
      "mikhail-kutuzov", 
      "nikolai-rostov"
    ],
    "summary": "Начало катастрофического отступления наполеоновской армии из России. Французы страдают от голода, холода и постоянных атак партизан.",
    "quotes": [
      "Отступление французов из Москвы было хаотичным и жестоким.",
      "Наполеон, понимая, что его армия разгромлена, отдал приказ об отступлении.",
      "Пьер Безухов, наблюдая за отступлением, почувствовал, что война наконец подходит к концу.",
      "Русские войска преследовали французов, нанося им тяжелые потери.",
      "Отступление из Москвы стало началом конца для Наполеона и его армии."
    ],
    "significance": "Кульминация поражения Наполеона в России. Показывает народный характер войны и стратегическую мудрость Кутузова. Символизирует крах наполеоновской империи."
  },
  {
    "id": "partisan-war",
    "title": "Партизанская война",
    "date": "1812-10-01",
    "placeId": "smolensk", 
    "type": "war",
    "participants": [
      "denisov",
      "petya-rostov",
      "fedor-dolokhov", 
      "mikhail-kutuzov"
    ],
    "summary": "Народная партизанская война против отступающей французской армии. Партизаны под руководством Денисова и Долохова наносят значительный урон врагу.",
    "quotes": [
      "Партизанская война была жестокой и беспощадной.",
      "Русские партизаны, вооруженные только вилами и топорами, сражались с французами.",
      "Денисов и Петя Ростов были среди тех, кто проявил особую храбрость в этих боях.",
      "Петя Ростов, молодой и полный энтузиазма, мечтал о славе и героизме.",
      "Партизанская война показала, что русские готовы сражаться за свою родину до последней капли крови."
    ],
    "significance": "Демонстрирует народный характер Отечественной войны. Показывает героизм простых людей. Гибель Пети Ростова становится одной из самых трагических сцен романа."
  },
  {
    "id": "duel-with-pierre",
    "title": "Дуэль Пьера Безухова с Долоховым",
    "date": "1806-06-01",
    "placeId": "st-petersburg",
    "type": "duel",
    "participants": [
      "pierre-bezukhov",
      "fedor-dolokhov",
      "helene-kuragina"
    ],
    "summary": "Пьер вызывает Долохова на дуэль после слухов о связи Элен с Долоховым. Дуэль становится нравственным потрясением и переломным моментом в жизни Пьера.",
    "detailed_description": "Полусплетни, полунамеки о связи Элен с Долоховым ранят самолюбие и чувство имущества Пьера. Не умея разобраться ни в себе, ни в жене, Пьер, ведомый кодексом 'чести' света, вызывает Долохова на дуэль. Снежное поле, равнодушие секундантов, спокойная насмешливость Долохова и неумение Пьера даже держать пистолет подчёркивают абсурд происходящего. Пьер ранит Долохова, сам остаётся жив – и переживает ужас: он впервые ощущает себя убийцей. Дуэль приводит к разрыву с Элен, внутреннему кризису и поиску иной системы ценностей.",
    "quotes": [
      "Долохов стоял спокойно, с насмешливой улыбкой…",
      "Он чувствовал, что убил человека… и это казалось ему так ужасно…",
      "Он не мог представить себе… как люди могут смотреть на него…"
    ],
    "significance": "Ключевой поворот в духовной биографии Пьера: столкновение с реальностью убийства разрушает его доверие к 'чести' и нормам света. Сюжетно ведёт к разрыву с Элен и вступлению в масонство.",
    "themes": [
      "honor",
      "duel",
      "spiritual-search",
      "family-and-love"
    ],
    "symbolism": "Дуэль как символ светской фальшивой чести и бессмысленного насилия; кровь как цена за ложные представления о достоинстве.",
    "historical_context": "Начало XIX века, господство дуэльного кодекса в дворянской среде.",
    "character_development": "Пьер – переживает нравственный ужас и утрату доверия к светским нормам, выкристаллизовывается потребность в истинной морали; Долохов – предстаёт как опасный, но последовательный носитель 'дикой чести'; Элен – катализатор конфликта, остающаяся внешне 'невинной'.",
    "textLink": "2.1.10"
  },
  {
    "id": "austerlitz-battle",
    "title": "Битва под Аустерлицем",
    "date": "1805-12-02",
    "placeId": "austerlitz",
    "type": "battle",
    "participants": [
      "andrei-bolkonsky",
      "napoleon-bonaparte",
      "nikolai-rostov"
    ],
    "summary": "Кульминационное сражение кампании 1805 года, ставшее военным поражением русско‑австрийской армии и духовным переломом для Андрея Болконского.",
    "detailed_description": "Под Аустерлицем Андрей, мечтающий о 'своём Тулоне', ищет личную славу и подвиг. В хаосе боя он поднимает знамя и бежит вперёд, но ядро валит его с ног. Лежа на земле, Андрей видит 'высокое небо' и понимает тщетность своих честолюбивых порывов: на фоне вечности сражение и его амбиции ничтожны. Встреча с Наполеоном, который любуется 'прекрасной смертью' неизвестного офицера, завершает разоблачение иллюзии 'великого человека'. Николай Ростов в этом же бою переживает свой первый подлинный страх и урок войны.",
    "quotes": [
      "Над ним не было ничего уже, кроме неба, — высокого неба… неизмеримо высокого…",
      "Как же я не видал прежде этого высокого неба?..",
      "Наполеон казался ему теперь таким же маленьким, ничтожным существом…"
    ],
    "significance": "Для Андрея – коренной перелом мировоззрения: от культа славы к осознанию её пустоты. Для Толстого – ключевой образ для критики героизма и 'теории великих людей'. Для Николая – первый серьёзный опыт войны как ужаса, а не парада.",
    "themes": [
      "war-and-peace",
      "freedom-and-necessity",
      "life-and-death"
    ],
    "symbolism": "Высокое небо Аустерлица – символ вечности и подлинных ценностей, перед которыми теряет значение человеческая слава.",
    "historical_context": "Решающее сражение войны Третьей коалиции, вошедшее в историю как 'битва трёх императоров'.",
    "character_development": "Андрей – крушение иллюзий, начало глубокого духовного поиска; Наполеон – разоблачение образа 'великого человека' как мелкого тщеславца; Николай – первый опыт страха и честного признания собственной слабости.",
    "textLink": "1.3.16"
  },
  {
    "id": "liza-death",
    "title": "Смерть Лизы Болконской",
    "date": "1806-07-01",
    "placeId": "lysye-gory",
    "type": "personal",
    "participants": [
      "andrei-bolkonsky",
      "liza-bolkonskaya",
      "maria-bolkonskaya",
      "nikolai-bolkonsky"
    ],
    "summary": "Смерть жены Андрея Болконского при родах становится для него тяжёлым ударом и усиливает его чувство вины и отчуждения от прежней жизни.",
    "detailed_description": "Вернувшись с войны, Андрей находит маленькую княгиню Лизу при смерти после тяжёлых родов. Она умирает, оставив ребёнка. Андрей остро ощущает свою вину: он не любил её, искал 'подвигов' вне семьи, и теперь видит, что его холодность и разрыв с домашней жизнью стоили ей жизни. Смерть Лизы обрывает связь Андрея с прежним 'светлым' и поверхностным существованием, толкая его в сторону уединения, внутренней работы и печального скепсиса. Для Марьи и старого князя это тоже тяжёлое испытание и повод к переоценке семейных отношений.",
    "quotes": [
      "Он чувствовал себя виноватым… эта маленькая княгиня умерла оттого, что он не любил её…",
      "Эта мысль преследовала его, окончательно разрывая связи с его прежней, 'светлой' жизнью."
    ],
    "significance": "Углубляет душевный кризис Андрея; переводит его из состояния 'разочарованного светского героя' в состояние человека, несущего тяжёлое чувство вины и ответственность за близких. Для линии Марьи – усиление её опоры на веру и смирение.",
    "themes": [
      "death",
      "guilt",
      "family",
      "life-and-death"
    ],
    "symbolism": "Смерть Лизы – символ хрупкости человеческой жизни и цены эмоциональной холодности; детская колыбель рядом с мёртвой матерью – образ разрыва поколений.",
    "historical_context": "Начало XIX века, высокая материнская смертность при родах.",
    "character_development": "Андрей – укрепление чувства вины и уход в уединение; Марья – усиление роли 'христианской утешительницы'; старый князь – обострение его жесткости и скрытого страха потерь.",
    "textLink": "2.1.15"
  },
  {
    "id": "nikolai-gambling",
    "title": "Карточный проигрыш Николая Ростова",
    "date": "1806-12-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "nikolai-rostov",
      "fedor-dolokhov"
    ],
    "summary": "Николай Ростов проигрывает огромную сумму Долохову, ставя под угрозу финансовое положение семьи Ростовых.",
    "detailed_description": "В офицерском кругу Николай, увлечённый азартной игрой и подогреваемый задетой честью, вступает в карточное состязание с Долоховым. Не умея вовремя остановиться, он проигрывает огромную сумму, равную годовым доходам семьи. В одну секунду запал юношеского самолюбия превращается в долговую кабалу и в реальную угрозу разорения Ростовых. Николай впервые остро чувствует свою ответственность за родителей и сестёр, но уже ничего не может изменить.",
    "quotes": [
      "В одну секунду решилась судьба всей семьи…",
      "Николай Ростов, поддавшись азарту, проиграл огромную сумму Долохову."
    ],
    "significance": "Выявляет юношескую незрелость Николая и его подверженность азарту. Становится первым серьёзным уроком долга перед семьёй и шагом от романтического рыцарства к более трезвому взгляду на жизнь.",
    "themes": [
      "responsibility",
      "gambling",
      "family"
    ],
    "symbolism": "Карточный проигрыш – символ лёгкомыслия и безответственности дворянской молодёжи, живущей на деньги родителей и мужиков.",
    "historical_context": "Азартные игры как часть офицерского быта и светских развлечений дворянства.",
    "character_development": "Николай – от непосредственного, беспечного гусара к человеку, начинающему ощущать тяжесть семейного долга; Долохов – образ опытного и хищного игрока.",
    "textLink": "2.2.10"
  },
  {
    "id": "pierre-masonry",
    "title": "Вступление Пьера в масонство",
    "date": "1807-01-01",
    "placeId": "st-petersburg",
    "type": "personal",
    "participants": [
      "pierre-bezukhov"
    ],
    "summary": "Пьер вступает в масонство, надеясь найти опору и смысл жизни после дуэли с Долоховым и разрыва с Элен.",
    "detailed_description": "Пережив дуэль и осознав ложь своего брака, Пьер оказывается в состоянии духовного хаоса. Встреча с масоном в гостинице и участие в таинственном обряде посвящения производят на него огромное впечатление. Идеи братства, нравственного самосовершенствования и служения человечеству кажутся Пьеру ответом на его мучительные вопросы. Он верит, что вступил в братство людей, 'имеющих истину', и что теперь жизнь его получит твёрдую опору и план.",
    "quotes": [
      "Он чувствовал, что вступил в братство людей, имеющих истину…",
      "Ему казалось, что он нашёл то, чего искал… новый, твёрдый оплот…"
    ],
    "significance": "Начало религиозно‑философского поиска Пьера. Масонство становится важным этапом его пути: через увлечение внешней системой он придёт к разочарованию в формализме и к живой, внутренней вере.",
    "themes": [
      "spiritual-search",
      "freemasonry",
      "faith-and-reason"
    ],
    "symbolism": "Масонство как символ попытки найти истину во внешней системе и иерархии; масонская ложа – модель рационализированной религии.",
    "historical_context": "Распространение масонских лож среди русского дворянства в конце XVIII – начале XIX века.",
    "character_development": "Пьер – от стихийного, неоформленного поиска смысла к систематизированной, но ещё внешней духовности; в будущем этот опыт будет переосмыслен и отчасти отвергнут.",
    "textLink": "2.2.12"
  },
  {
    "id": "pierre-reforms",
    "title": "Реформы Пьера в имениях",
    "date": "1807-06-01",
    "placeId": "kiev-province",
    "type": "social",
    "participants": [
      "pierre-bezukhov"
    ],
    "summary": "Пьер под влиянием масонских убеждений пытается провести гуманитарные реформы в своих имениях, но сталкивается с сопротивлением практики и человеческой инерции.",
    "detailed_description": "Воодушевлённый масонскими идеями братства и улучшения участи 'братьев меньших', Пьер отправляется в свои киевские имения. Он отменяет некоторые барщинные повинности, вводит штрафы за жестокое обращение с крестьянами, изменяет систему управления. Но управляющие саботируют приказы, переводя всё в формальные распоряжения, крестьяне не понимают и не доверяют изменениям, а реальные злоупотребления продолжаются. Пьер видит, что 'никак не может добиться того, чего хочет', и переживает разочарование в возможности 'одним указом' сделать людей счастливыми.",
    "quotes": [
      "Пьер видел, что никак не мог добиться того, чего хотел…",
      "Этот опыт показывает наивность 'доброго барина', не знающего реальных механизмов управления."
    ],
    "significance": "Показывает наивность Пьера и ограниченность сверхунизовых реформ в условиях крепостного строя. Усиливает его сомнения в эффективности внешних систем (включая масонство) и подводит к более глубокой, личностной духовной работе.",
    "themes": [
      "social-reform",
      "naivety",
      "freedom-and-necessity"
    ],
    "symbolism": "Реформы 'сверху' как символ утопии благих намерений, не учитывающих реальную структуру власти и человеческую природу.",
    "historical_context": "Крепостное право в России, попытки отдельных владельцев смягчить положение крестьян до реформ Александра II.",
    "character_development": "Пьер – от оптимистического верования в могущество 'разумной системы' к скепсису и осознанию сложности человеческих отношений; усиливается его внутренний кризис и готовность к более радикальным духовным переменам.",
    "textLink": "2.2.14"
  },
  {
    "id": "natasha-and-andrei-meeting",
    "title": "Первая встреча Андрея с Наташей в Отрадном",
    "date": "1809-08-01",
    "placeId": "otradnoye",
    "type": "personal",
    "participants": [
      "natasha-rostova",
      "andrei-bolkonsky",
      "sonya",
      "ilya-rostov"
    ],
    "summary": "В имении Ростовых Отрадном князь Андрей видит Наташу Ростову и её 'русский' танец, что становится для него моментом духовного возрождения.",
    "detailed_description": "Уставший от жизни, переживший Аустерлиц и смерть жены Андрей приезжает к Ростовым в Отрадное. Ночная сцена, когда он подслушивает разговор Наташи и Сони о красоте ночи, и последующий деревенский танец Наташи перед дядюшкой и гостями потрясают Андрея. Он видит в ней воплощение живой, народной, русской стихии: безыскусной, но глубоко гармоничной. В нём просыпается давно угасшая радость, ощущение возможности новой жизни и любви.",
    "quotes": [
      "Эта девушка так русская, в ней что‑то особенное, по‑русски женское…",
      "Как она это делает, и откуда она взяла это?"
    ],
    "significance": "Становится точкой 'второго рождения' Андрея, открывая линию его любви к Наташе и соединяя рационального скептика с миром чувства и народной жизни.",
    "themes": [
      "love",
      "russian-soul",
      "family-and-love"
    ],
    "symbolism": "Танец Наташи – символ стихийной жизненной силы и 'русской души', способной возродить даже разочарованного человека.",
    "historical_context": "Мир дворянских усадеб, где переплетаются европейские формы и народные традиции.",
    "character_development": "Андрей – возвращение интереса к жизни и людям, подготовка к помолвке; Наташа – проявление её природной, не 'салонной' красоты; семья Ростовых – пример 'тёплой' России, противопоставленной петербургским салонам.",
    "textLink": "2.3.1"
  },
  {
    "id": "natasha-and-andrei-engagement",
    "title": "Помолвка Наташи Ростовой и Андрея Болконского",
    "date": "1809-01-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "natasha-rostova",
      "andrei-bolkonsky",
      "nikolai-bolkonsky",
      "maria-bolkonskaya",
      "ilya-rostov",
      "natalya-rostova-senior"
    ],
    "summary": "Князь Андрей делает предложение Наташе. Помолвка утверждена, но по воле старого князя отложена на год, что становится испытанием для Наташи и одной из причин дальнейшего разрыва.",
    "detailed_description": "После первого бала в Москве и посещения Ростовых Андрей делает Наташе предложение. Она с восторгом принимает, видя в нём идеал мужчины и будущего мужа. Старый князь Болконский формально соглашается, но настаивает на годичной отсрочке брака, фактически испытывая и сына, и невесту. Для взрослого Андрея это время – возможность всё взвесить, для юной и нетерпеливой Наташи – мучительное ожидание, наполненное сомнениями и скукой. Именно в этот год её душа оказывается уязвимой для соблазна Анатоля.",
    "quotes": [
      "Да, я счастлив, – сказал Андрей, – но есть что‑то тревожащее…",
      "Его отец, старый князь Болконский, настаивает на отсрочке…",
      "Для юной и нетерпеливой Наташи этот год становится временем томительного ожидания."
    ],
    "significance": "Вершина романтической линии Андрея и Наташи и одновременно предпосылка трагедии: отсрочка, продиктованная отчасти разумом, отчасти гордыней старого князя, превращается в испытание, с которым Наташа не справляется.",
    "themes": [
      "love",
      "waiting",
      "family",
      "freedom-and-necessity"
    ],
    "symbolism": "Помолвка – символ надежды и одновременно 'испытательного срока' для любви; год ожидания – образ времени как силы, разрушающей незрелые чувства.",
    "historical_context": "Дворянские традиции помолвок и родительского контроля над браками.",
    "character_development": "Андрей – сочетание зрелой любви с внутренней тревогой; Наташа – переход от восторга к мучительному ожиданию; старый князь – проявление деспотизма и ревности к сыну.",
    "textLink": "2.3.14"
  },
  {
    "id": "attempted-elopement-natasha",
    "title": "Попытка побега Наташи Ростовой с Анатолем Курагиным",
    "date": "1810-08-01",
    "placeId": "moscow",
    "type": "scandal",
    "participants": [
      "natasha-rostova",
      "anatole-kuragin",
      "sonya",
      "helene-kuragina",
      "pierre-bezukhov"
    ],
    "summary": "Наташа, измученная ожиданием Андрея, поддаётся обаянию Анатоля Курагина и соглашается на побег, который, впрочем, срывается благодаря вмешательству Сони и Пьера.",
    "detailed_description": "В московском доме Элены Курагиной Наташа знакомится с Анатолем. Его уверенность, красота и напор производят на неё ослепляющее впечатление. Не зная, что он уже женат, Наташа увлекается, забывая о помолвке с Андреем. По наущению Элен и при участии Долохова Анатоль организует ночной побег: карета, лестница, тайные письма. Соня случайно узнаёт о плане и сообщает Ростовым, Пьер помогает предотвратить побег. Узнав правду об Анатоле, Наташа переживает страшный стыд и отчаяние, пытается отравиться.",
    "quotes": [
      "Она чувствовала, что погибает и что не может сопротивляться…",
      "Она хотела умереть…"
    ],
    "significance": "Кризисный пик в жизни Наташи: падение и последующее покаяние. Сюжетно приводит к разрыву с Андреем и углубляет её характер – от наивной девушки к женщине, пережившей грех и раскаяние. Одновременно вскрывает цинизм семьи Курагиных.",
    "themes": [
      "betrayal",
      "redemption",
      "love",
      "family-and-love"
    ],
    "symbolism": "Попытка побега – символ искушения и падения, 'поворот не туда' в духовном пути; спасение – образ милости и вмешательства добра.",
    "historical_context": "Моральные нормы и светские скандалы в дворянском обществе начала XIX века.",
    "character_development": "Наташа – от увлечённой страстью до глубочайшего раскаяния; Анатоль – предстаёт как безответственный соблазнитель; Соня – проявляет нравственную твёрдость; Пьер – его сострадание к Наташе углубляет его собственные чувства к ней.",
    "textLink": "2.5.15"
  },
  {
    "id": "borodino-battle",
    "title": "Бородинское сражение",
    "date": "1812-09-07",
    "placeId": "borodino",
    "type": "battle",
    "participants": [
      "andrei-bolkonsky",
      "pierre-bezukhov",
      "mikhail-kutuzov",
      "napoleon-bonaparte",
      "nikolai-rostov"
    ],
    "summary": "Крупнейшее сражение Отечественной войны 1812 года. Русская армия под командованием Кутузова даёт генеральную битву войскам Наполеона. Для Андрея это последнее сражение, для Пьера – духовный перелом.",
    "detailed_description": "На Бородинском поле сходятся две огромные армии. Для Наполеона это попытка одним ударом сломить Россию, для Кутузова – тяжёлое, но неизбежное сражение, призванное удержать дух армии. Князь Андрей, снова на передовой, чувствует себя частью общего дела, забывая личные драмы. Здесь он получает смертельное ранение. Пьер приезжает на поле боя как случайный 'волонтёр‑наблюдатель', но быстро становится свидетелем настоящего ужаса: смерти, страха, стойкости солдат. Его прежние романтические и теоретические представления о войне рушатся. На фоне карт и диспозиций Толстой показывает стихийность боя, неподконтрольность его 'великим людям'.",
    "quotes": [
      "Для князя Андрея теперь не существовало ни Павлова дома, ни Наташи…",
      "Пуля ударила в грудь, и он подумал: вот и всё…",
      "Пьер, прибывший на поле боя как наблюдатель, испытывает шок и разрушение своих наивных представлений о войне."
    ],
    "significance": "Военно‑историческая кульминация романа. Подтверждает толстовскую мысль о невозможности 'управлять' историей с картой в руках, подчёркивает нравственное превосходство русской армии. Завершает земной путь Андрея и становится моментом духовного перерождения Пьера.",
    "themes": [
      "war-and-peace",
      "sacrifice",
      "heroism",
      "freedom-and-necessity"
    ],
    "symbolism": "Бородино – символ народного единства и жертвенности, 'нравственной победы', влекущей отступление Наполеона.",
    "historical_context": "Отечественная война 1812 года, решающее сражение между армиями Кутузова и Наполеона.",
    "character_development": "Андрей – от солдата‑героя к готовности умереть во имя высшего; Пьер – от стороннего философа к человеку, увидевшему реальную цену войны; Кутузов – проявляет мудрость и умение 'не мешать' армии; Наполеон – показан оторванным от реальности боя.",
    "textLink": "3.2.19"
  },
  {
    "id": "fili-council",
    "title": "Совет в Филях",
    "date": "1812-09-13",
    "placeId": "fili",
    "type": "military",
    "participants": [
      "mikhail-kutuzov"
    ],
    "summary": "Кутузов принимает решение оставить Москву, вопреки мнению большинства генералов, беря на себя всю ответственность.",
    "detailed_description": "После Бородинского сражения русская армия отходит к Москве. На совете в деревне Фили генералы спорят: одни требуют нового боя под стенами столицы, другие предлагают отступление. Кутузов, внешне усталый и сентиментальный старик, внутренне одинок в своём понимании необходимости спасения армии любой ценой. Со слезами на глазах он произносит: 'Потерять Москву – не потерять Россию', и решает оставить город. Этот акт смирения перед исторической необходимостью становится высшим проявлением его полководческой мудрости.",
    "quotes": [
      "Кутузов плакал… – Потерять Москву – не потерять Россию…",
      "Этот эпизод демонстрирует его глубокую ответственность перед народом."
    ],
    "significance": "Ключевой эпизод, в котором Толстой противопоставляет подлинное руководство (заботу о народе и армии) жажде внешней славы. Решение оставить Москву готовит победу в войне и подчёркивает различие между Кутузовым и Наполеоном.",
    "themes": [
      "war-and-peace",
      "leadership",
      "sacrifice",
      "freedom-and-necessity"
    ],
    "symbolism": "Совет в Филях – символ мудрого отказа от внешних атрибутов ради сохранения сущности: города ради страны, славы ради жизни армии.",
    "historical_context": "Отечественная война 1812 года; стратегический поворотный момент, вызвавший споры у современников.",
    "character_development": "Кутузов – вершина его как народного полководца, готового идти против 'формальной логики' генералов ради глубинной необходимости; генералы – показаны как заложники честолюбия и формальных представлений о войне.",
    "textLink": "3.3.15"
  },
  {
    "id": "rostovs-evacuation",
    "title": "Эвакуация Ростовых из Москвы",
    "date": "1812-09-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "natasha-rostova",
      "ilya-rostov",
      "natalya-rostova-senior",
      "sonya",
      "andrei-bolkonsky"
    ],
    "summary": "Ростовы покидают Москву. По инициативе Наташи семья отказывается от части имущества ради перевозки раненых офицеров, среди которых оказывается Андрей Болконский.",
    "detailed_description": "В хаосе эвакуации из Москвы Ростовы загружают подводы своим имуществом, пытаясь спасти хоть что‑то из нажитого. Увидев раненых, оставленных без транспорта, Наташа испытывает нравственный шок: как можно вывозить мебель, когда рядом лежат умирающие люди? Она убеждает отца отдать подводы под раненых. Илья Ростов, колеблясь между жалостью и страхом за семью, в конце концов соглашается. В их подводы грузят раненых, среди которых – смертельно раненный князь Андрей. Решение Ростовых усиливает их финансовое разорение, но возвышает их нравственно.",
    "quotes": [
      "Наташа вдруг покраснела и вскочила: – Папа, раненые!.. Как же так мы можем?..",
      "– Что ж, что ж… – говорил он, – если нужно… везите раненых…"
    ],
    "significance": "Один из нравственных пиков линии Ростовых и особенно Наташи. Сцена подчёркивает приоритет человеческой жизни над имуществом и показывает, как война становится проверкой истинных ценностей.",
    "themes": [
      "sacrifice",
      "compassion",
      "family",
      "russian-soul"
    ],
    "symbolism": "Отказ от имущества – символ жертвы и выбора в пользу высших ценностей; подводы с ранеными – образ 'движущейся совести' уходящей Москвы.",
    "historical_context": "Эвакуация Москвы 1812 года, массовый исход жителей, брошенные раненые.",
    "character_development": "Наташа – нравственное возмужание, переход к жертвенной любви; Илья – от растерянности к готовности жертвовать ради других; Андрей – подготавливается встреча с Наташей и его предсмертное преображение.",
    "textLink": "3.3.17"
  },
  {
    "id": "natasha-and-andrei-reconciliation",
    "title": "Встреча Наташи с умирающим Андреем",
    "date": "1812-10-01",
    "placeId": "yaroslavl",
    "type": "personal",
    "participants": [
      "natasha-rostova",
      "andrei-bolkonsky",
      "maria-bolkonskaya",
      "natalya-rostova-senior"
    ],
    "summary": "Наташа ухаживает за смертельно раненым Андреем Болконским, и их встреча становится актом взаимного прощения и духовного завершения их истории.",
    "detailed_description": "В доме Ростовых, куда привезли раненого Андрея, Наташа узнаёт его среди других офицеров. Сначала она боится подойти, чувствуя вину за своё прошлое предательство, но затем берёт на себя уход за ним. Андрей, уже перешагнувший грань личных обид, говорит, что любит её 'лучше, чем прежде', и прощает не только её, но и самого себя. Наташа переживает новую, очищенную любовь – не эгоистическое чувство 'для себя', а жертвенное 'ради него'. Смерть Андрея изображена Толстым как переход в иное измерение, как духовное пробуждение.",
    "quotes": [
      "Я люблю тебя больше, лучше, чем прежде…",
      "Она поняла, что любит его не за себя, а за него…"
    ],
    "significance": "Завершает духовный путь Андрея: он умирает, освободившись от гордыни и обиды. Для Наташи это событие – окончательное очищение и переход к зрелой, жертвенной любви. Для линии семей и темы 'семья и любовь' – доказательство, что истинная любовь сильнее ошибки.",
    "themes": [
      "love",
      "forgiveness",
      "death",
      "life-and-death"
    ],
    "symbolism": "Смерть Андрея – символ духовного перерождения, отказа от земной славы ради высшей любви; забота Наташи – образ христианского служения.",
    "historical_context": "Отголосок Бородино и отступления 1812 года на частной, человеческой судьбе.",
    "character_development": "Андрей – достигает христианского смирения и всепрощения; Наташа – проходит через боль и расставание к состоянию внутренней цельности; Марья – остаётся ангелом‑утешительницей и молитвенной опорой.",
    "textLink": "3.3.31"
  },
  {
    "id": "helene-death",
    "title": "Смерть Элен Курагиной",
    "date": "1812-11-01",
    "placeId": "st-petersburg",
    "type": "personal",
    "participants": [
      "helene-kuragina",
      "pierre-bezukhov"
    ],
    "summary": "Элен умирает при загадочных обстоятельствах, связанных с попыткой аборта. Её смерть символизирует крушение мира светской фальши, который она олицетворяла.",
    "detailed_description": "Элен, запутавшись в своих многочисленных романах и брачных планах, решает через переход в католичество добиться развода с Пьером и вступить в новый выгодный брак. Беременея и пытаясь скрыть это с помощью сомнительных лекарств, она внезапно умирает. Толстой намеренно не описывает сцену в деталях, но даёт понять, что смерть связана с попыткой аборта. О ней распространяются 'странные слухи'. Для Пьера известие о её смерти во время плена и войны становится не столько личным горем, сколько освобождением от ядовитой связи со светской ложью.",
    "quotes": [
      "Вдруг распространились слухи о странной, скоропостижной смерти Элен…",
      "Она умерла так же, как и жила — не понимая ничего, не веря ни во что, не любя никого, кроме себя."
    ],
    "significance": "Подводит итог линии Элен и Курагиных: мир чистой внешности, расчёта и безнравственности самоуничтожается. Освобождает Пьера для нового этапа жизни, в том числе для сближения с Наташей.",
    "themes": [
      "death",
      "freedom",
      "family-and-love"
    ],
    "symbolism": "Смерть Элен – символ конца 'космополитического' светского мира, лишённого корней и веры; моральная расплата за жизнь, прожитую только ради внешнего блеска.",
    "historical_context": "Мораль и медицина начала XIX века; фактическая невозможность официального развода без серьёзных манёвров.",
    "character_development": "Пьер – окончательно разрывает внутреннюю связь с прошлым браком; фигура Элен исчезает, но её тень как отрицательный идеал остаётся фоном для образов Наташи и Марьи.",
    "textLink": "4.1.1"
  },
  {
    "id": "pierre-captivity",
    "title": "Плен Пьера и встреча с Платоном Каратаевым",
    "date": "1812-09-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "pierre-bezukhov",
      "platon-karatayev"
    ],
    "summary": "Пьер, оставшийся в сожжённой Москве, попадает в плен к французам и знакомится с Платоном Каратаевым, воплощающим народную мудрость и смирение.",
    "detailed_description": "После пожара Москвы Пьер, пережив внутренний кризис и неудавшуюся попытку сыграть роль 'исторического убийцы' Наполеона, арестован французами как подозрительный поджигатель. В лагере пленных он встречает Платона Каратаева – пожилого крестьянского солдата, живущего в любви, смирении и благодарности за каждую мелочь. Каратаев рассказывает простые сказки, поёт, работает, принимает лишения без ропота. Для Пьера эта встреча становится открытием 'настоящей жизни', в которой нет ни салонной игры, ни рационалистического самоанализа, а есть простое добро.",
    "quotes": [
      "Ему казалось теперь, что прежде он жил не настоящей жизнью…",
      "В этом маленьком, кругленьком человеке… было что‑то такое, что Пьеру казалось давно известным…"
    ],
    "significance": "Кульминация духовной эволюции Пьера: он находит живой образ той истины, которую искал через масонство и философию. Каратаев показывает ему путь к внутреннему миру, не зависящему от внешних обстоятельств.",
    "themes": [
      "spiritual-search",
      "wisdom",
      "acceptance",
      "faith-and-reason"
    ],
    "symbolism": "Каратаев – живой символ народного христианства; плен – место, где внешняя несвобода оборачивается внутренней свободой.",
    "historical_context": "Плен русских солдат во время отступления французов из сожжённой Москвы.",
    "character_development": "Пьер – освобождается от прежней раздробленности, обретает цельность и способность к простому счастью; Каратаев – выступает как 'тихий святой', не знающий теорий, но живущий в соответствии с ними.",
    "textLink": "4.1.5"
  },
  {
    "id": "karataev-death",
    "title": "Смерть Платона Каратаева",
    "date": "1812-10-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "pierre-bezukhov",
      "platon-karatayev"
    ],
    "summary": "Платон Каратаев, заболев и отстав от колонны пленных, расстреливается французским солдатом. Его тихая смерть становится завершающим уроком для Пьера.",
    "detailed_description": "При отступлении французов Каратаев заболевает и начинает отставать от колонны. Когда он садится отдохнуть, французский солдат по приказу командира стреляет в него. Пьер, по совету товарищей, не оборачивается, зная, что это – конец земного пути Каратаева. Эта смерть без протеста, без пафоса, в полной покорности судьбе закрепляет для Пьера образ идеальной простоты и принятия.",
    "quotes": [
      "Пьер шёл и не оборачивался; он знал, что Платона уже нет…",
      "Эта смерть становится завершающим 'уроком' для Пьера — он учится принимать смерть как часть жизни."
    ],
    "significance": "Закрывает линию Каратаева и завершает ученичество Пьера. Платон 'уходит', но остаётся в душе Пьера как внутренний ориентир. Для темы жизни и смерти показывает христианский тип смерти – без страха и бунта.",
    "themes": [
      "death",
      "acceptance",
      "spiritual-growth",
      "life-and-death"
    ],
    "symbolism": "Смерть Каратаева – символ тихого, безропотного ухода праведника и принятия смерти как естественного перехода.",
    "historical_context": "Отступление французской армии и жестокость по отношению к пленным.",
    "character_development": "Пьер – окончательно усваивает урок Каратаева, учится жить с памятью о нём как о внутреннем образце; Каратаев – уходит так же просто и незаметно, как жил.",
    "textLink": "4.1.10"
  },
  {
    "id": "petya-death",
    "title": "Гибель Пети Ростова",
    "date": "1812-10-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "petya-rostov",
      "denisov"
    ],
    "summary": "Юный Петя Ростов гибнет в партизанской вылазке отряда Денисова, сталкиваясь с реальностью войны, которую он воспринимал как игру.",
    "detailed_description": "Петя, получив разрешение быть при отряде Денисова, горит желанием совершить подвиг. Во время ночной вылазки он, увлечённый романтикой момента, ведёт себя так, будто это игра. В стычке с французами пуля попадает в него, и он падает, всё ещё как бы не веря в смерть. Его гибель становится страшным ударом для семьи Ростовых и тяжёлым нравственным потрясением для Денисова, который чувствует ответственность за мальчика.",
    "quotes": [
      "Петя стоял, улыбаясь, и вдруг повалился…",
      "Это событие подчёркивает бессмысленную жестокость войны."
    ],
    "significance": "Показывает войну как пожирателя детства и невинности. На частном примере Пети Толстой раскрывает цену 'народной войны' и разрушение романтических представлений о подвиге.",
    "themes": [
      "war-and-peace",
      "death",
      "family",
      "life-and-death"
    ],
    "symbolism": "Смерть Пети – символ невинной жертвы войны, гибели иллюзий юности.",
    "historical_context": "Партизанские действия в тылу отступающей французской армии.",
    "character_development": "Семья Ростовых – переживает неутешимую утрату; Денисов – испытывает острое чувство вины и ещё яснее понимает ужас войны.",
    "textLink": "4.2.5"
  },
  {
    "id": "natasha-and-pierre-meeting",
    "title": "Встреча Наташи Ростовой и Пьера Безухова после войны",
    "date": "1812-12-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "natasha-rostova",
      "pierre-bezukhov",
      "nikolai-rostov",
      "maria-bolkonskaya"
    ],
    "summary": "После войны, плена, смерти Андрея и Пети Пьер возвращается в Москву и встречает изменившуюся Наташу. Между ними оформляется глубокая духовная близость, ведущая к браку.",
    "detailed_description": "Пьер, вышедший из плена и внутренне переродившийся, приезжает к Ростовым. Наташа, осунувшаяся от горя по Андрею и Пете, 'потухшая' светская красавица, узнаёт в Пьере человека, который понимает её страдания. В их спокойном, доверительном разговоре о пережитом рождении детей, войне, смерти, будущей жизни зарождается новое чувство – зрелая любовь двух людей, прошедших через страдания. Эта встреча становится началом их семейного союза.",
    "quotes": [
      "Пьер, увидев Наташу, понял, что его чувства к ней стали глубже и серьёзнее.",
      "Они говорили о прошлом, о войне, о своих надеждах и мечтах."
    ],
    "significance": "Кульминация духовных линий Пьера и Наташи: найден 'ответ' на их поиски смысла в форме спокойной семейной любви. Подводит к эпилогу и утверждает толстовский идеал счастья в семье.",
    "themes": [
      "love",
      "redemption",
      "family",
      "family-and-love"
    ],
    "symbolism": "Встреча после войны – символ начала новой, мирной жизни, рождающейся из руин старого мира.",
    "historical_context": "Послевоенное время, возвращение к мирной жизни после 1812 года.",
    "character_development": "Наташа – от разбитой, скорбящей девушки к женщине, способной на новую любовь; Пьер – от искателя к человеку, нашедшему опору в конкретном человеке и семье.",
    "textLink": "4.4.16"
  },
  {
    "id": "epilogue-marriages",
    "title": "Браки Николая Ростова и Марьи Болконской, Пьера Безухова и Наташи Ростовой",
    "date": "1813-01-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "nikolai-rostov",
      "maria-bolkonskaya",
      "pierre-bezukhov",
      "natasha-rostova",
      "sonya",
      "ilya-rostov",
      "natalya-rostova-senior"
    ],
    "summary": "В эпилоге Николай женится на Марье Болконской, а Пьер — на Наташе Ростовой. Эти браки становятся воплощением толстовского идеала семейной гармонии и духовного единения.",
    "detailed_description": "К началу эпилога сформировалось две тесно связанные семьи: Николай и Марья живут в Лысых Горах, Пьер и Наташа — в Москве, часто бывая друг у друга. Николай становится 'хорошим хозяином, любящим мужем и строгим отцом', его рыцарский пыл сменяется ответственностью и трудом. Марья, много страдавшая в Лысых Горах, обретает тихое, но глубокое счастье. Наташа полностью отказывается от светской жизни, растворяясь в материнстве и заботе о муже и детях. Пьер живёт активной умственной жизнью, участвуя в 'Союзе', но центр его бытия — семья. Соня, жертвенно отказавшаяся от Николая, остаётся 'подругой дома'.",
    "quotes": [
      "Он был хороший хозяин, любящий муж и строгий отец…",
      "Наташа вся ушла в материнство…",
      "Он чувствовал, что уже не нужно искать, что истина… в той любви, которую он чувствовал к жене, к детям…"
    ],
    "significance": "Заключительная точка личных линий главных героев. Семья и труд показаны как высшая форма человеческого счастья и ответ на философские поиски Пьера и Андрея (пути которого символически завершаются в этих семьях).",
    "themes": [
      "family",
      "love",
      "harmony",
      "family-and-love"
    ],
    "symbolism": "Эти браки символизируют синтез 'старой' и 'новой' России: болконская строгость соединяется с ростовской теплотою.",
    "historical_context": "Послевоенная Россия, стабилизация дворянского быта и медленное движение к будущим социальным переменам.",
    "character_development": "Николай – от гусара к помещику‑труженику; Марья – от забитой дочери к счастливой хозяйке; Наташа – от бала и страсти к материнству; Пьер – от философских метаний к семейной устойчивости; Соня – остаётся тенью, но нравственно возвышенной.",
    "textLink": "4.4.20"
  }
]