[
  {
    "id": "soiree-anna-pavlovna",
    "title": "Вечер у Анны Павловны Шерер",
    "date": "1805-07-01",
    "placeId": "st-petersburg",
    "type": "salon",
    "participants": ["pierre-bezukhov", "andrei-bolkonsky", "helene-kuragina", "vasily-kuragin", "anna-scherer"],
    "summary": "Первый светский вечер в романе, представляющий микрокосм петербургского общества. Здесь завязываются основные сюжетные линии, проявляются характеры героев и их отношение к надвигающейся войне.",
    "detailed_description": "Вечер у фрейлины императрицы Анны Павловны Шерер становится экспозицией всего романа. В изысканной атмосфере салона сталкиваются разные мировоззрения: цинизм князя Василия Курагина, искренность Пьера Безухова, разочарованность Андрея Болконского в светской жизни. Обсуждаются политические события - казнь герцога Энгиенского и предстоящая война с Наполеоном.",
    "quotes": [
      "Вечер у Анны Павловны был в полном разгаре. Комната постепенно наполнялась гостями, и Анна Павловна, сидевшая у стола, на котором стояли чайный сервиз и самовар, разливала чай.",
      "Пьер Безухов, только что приехавший из-за границы, был также на этом вечере. Он был очень высокого роста, толстый, с широкими плечами, с открытым и добродушным лицом.",
      "Андрей Болконский, маленький, худощавый человек с острыми чертами лица, был также на вечере. Он сидел рядом с Анной Павловной и слушал ее рассказы.",
      "В салоне Анны Павловны говорили о политике, о войне, о Наполеоне, о предстоящем браке Пьера Безухова.",
      "Пьер чувствовал себя неловко в этом обществе, но Анна Павловна была очень мила с ним, и он чувствовал, что она помогает ему адаптироваться."
    ],
    "significance": "Ключевое событие, задающее тон всему роману. Показывает отрыв высшего общества от народа, антинациональную ориентацию аристократии. Здесь начинаются многие сюжетные линии: знакомство Пьера со светом, отношения Андрея и Пьера, завязка будущего брака Пьера и Элен. Демонстрирует искусственность светской жизни.",
    "themes": ["war-and-peace", "russian-soul"],
    "symbolism": "Салон как модель искусственного общества, французский язык как символ отрыва от национальных корней",
    "historical_context": "Начало войны Третьей коалиции против Наполеона, казнь герцога Энгиенского",
    "character_development": "Пьер - наивность и искренность, Андрей - разочарование в свете, Анна Шерер - искусственность, Василий Курагин - цинизм",
    "textLink": "1.1.1"
  },
  {
    "id": "austerlitz-battle",
    "title": "Битва под Аустерлицем",
    "date": "1805-12-02",
    "placeId": "austerlitz",
    "type": "battle",
    "participants": ["andrei-bolkonsky", "napoleon-bonaparte", "nikolai-rostov"],
    "summary": "Кульминационное сражение войны 1805 года, ставшее переломным моментом в жизни Андрея Болконского. Поражение союзных войск и встреча с Наполеоном приводят героя к духовному прозрению.",
    "detailed_description": "Сражение представлено через восприятие Андрея Болконского, который мечтает о 'своем Тулоне'. Однако реальность войны оказывается далека от его романтических представлений. Раненый, лежа на поле боя, Андрей видит 'высокое небо Аустерлица' и осознает ничтожность своих честолюбивых устремлений. Встреча с Наполеоном завершает этот процесс переоценки ценностей.",
    "quotes": [
      "Андрей Болконский, стоя на холме, наблюдал за движением войск. Он чувствовал, что сегодняшний день будет решающим.",
      "Вдруг раздался крик: 'Вперед! За императора!' и войска бросились в атаку.",
      "Андрей, схватив знамя, повел солдат в бой. Он чувствовал, как пуля пролетела мимо него, но не обратил на это внимания.",
      "В разгар сражения Андрей был тяжело ранен. Он упал на землю и почувствовал, что не может двигаться.",
      "Когда он пришел в себя, то увидел над собой лицо Наполеона, который склонился над ним и сказал: 'Какая прекрасная смерть!'",
      "Над ним не было ничего уже, кроме неба, — высокого неба, не ясного, но все-таки неизмеримо высокого."
    ],
    "significance": "Переломный момент для Андрея Болконского - он осознает ничтожность своих честолюбивых порывов и бессмысленность войны. Символизирует крах иллюзий о 'славе' и 'подвигах'. Начало духовных поисков героя.",
    "themes": ["war-and-peace", "freedom-and-necessity", "life-and-death"],
    "symbolism": "Высокое небо Аустерлица - символ вечности и истинных ценностей",
    "historical_context": "Решающее сражение войны Третьей коалиции, демонстрация военного гения Наполеона",
    "character_development": "Андрей - крушение иллюзий, начало духовного поиска; Наполеон - образ 'великого человека' подвергается критике",
    "textLink": "1.3.16"
  },
  {
    "id": "borodino-battle",
    "title": "Бородинское сражение",
    "date": "1812-09-07",
    "placeId": "borodino",
    "type": "battle",
    "participants": [
      "andrei-bolkonsky",
      "pierre-bezukhov",
      "napoleon-bonaparte",
      "mikhail-kutuzov",
      "nikolai-rostov"
    ],
    "summary": "Крупнейшее сражение Отечественной войны 1812 года. Кутузов дает генеральную битву Наполеону. Андрей Болконский получает смертельное ранение, Пьер Безухов наблюдает за сражением как волонтер.",
    "quotes": [
      "Бородинское поле было покрыто дымом и пылью. Солдаты сражались с отчаянной храбростью.",
      "Андрей Болконский, несмотря на свое ранение, снова был в строю. Он чувствовал, что должен быть здесь, в этом решающем сражении.",
      "Пьер Безухов, который также участвовал в сражении, чувствовал себя неловко в роли солдата, но был полон решимости сражаться за свою родину.",
      "Наполеон, наблюдая за сражением, понял, что это будет не легкая победа. Русские сражались с невиданной храбростью.",
      "К концу дня поле было усеяно телами павших. Бородинское сражение стало символом мужества и героизма русских солдат."
    ],
    "significance": "Кульминация войны 1812 года. Показывает нравственное превосходство русской армии. Становится завершением жизненного пути Андрея Болконского и моментом духовного перерождения Пьера Безухова.",
    "textLink": "3.2.19"
  },
  {
    "id": "moscow-fire",
    "title": "Пожар Москвы",
    "date": "1812-09-14",
    "placeId": "moscow",
    "type": "disaster",
    "participants": [
      "pierre-bezukhov",
      "napoleon-bonaparte"
    ],
    "summary": "После оставления Москвы русскими войсками город охватывает пожар. Пьер Безухов остается в горящей Москве, где спасает ребенка и защищает армянскую семью от французских мародеров.",
    "quotes": [
      "Наполеон вступил в Москву, ожидая найти богатый город, но вместо этого нашел пустые улицы и горящие дома.",
      "Пьер Безухов, увидев пожар, понял, что должен помочь. Он бросился в огонь, чтобы спасти ребенка.",
      "Пламя бушевало, и дым заполнял воздух. Пьер кашлял, но не останавливался, пока не нашел ребенка в горящем доме.",
      "Москва горела с разных сторон, и ее жгли русские, чтобы ничего не доставалось неприятелю.",
      "Пожар Москвы стал символом народной войны и патриотического подъема москвичей."
    ],
    "significance": "Символизирует народный характер войны. Показывает разрушительные последствия войны и духовное преображение Пьера Безухова. Становится началом конца для наполеоновской армии.",
    "textLink": "3.3.9"
  },
  {
    "id": "natasha-and-andrei-engagement",
    "title": "Помолвка Наташи Ростовой и Андрея Болконского",
    "date": "1809-01-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "natasha-rostova",
      "andrei-bolkonsky"
    ],
    "summary": "Андрей Болконский делает предложение Наташе Ростовой после бала. Помолвка остается тайной на год по требованию Андрея, что становится причиной будущего разрыва.",
    "quotes": [
      "Андрей Болконский, стоя перед Наташей, сказал: 'Я люблю вас и хочу, чтобы вы стали моей женой.'",
      "Наташа, покраснев от счастья, ответила: 'Да, я согласна.'",
      "После помолвки между Наташей и Андреем возникли совсем другие отношения – близкие, искренние, простые, без светского притворства.",
      "Князь Андрей настоял на том, чтобы помолвка оставалась тайной, так как он был причиной отсрочки и должен был нести всю тяжесть ее.",
      "Он говорил, что если Наташа убедится, что не любит его, или полюбит другого, она будет свободна."
    ],
    "significance": "Важный этап в развитии обоих персонажей. Показывает стремление к простому человеческому счастью. Год отсрочки становится испытанием для неопытной Наташи и приводит к трагическим последствиям.",
    "textLink": "2.3.14"
  },
  {
    "id": "pierre-marriage-to-helene",
    "title": "Женитьба Пьера Безухова на Элен Курагиной",
    "date": "1806-01-01",
    "placeId": "st-petersburg",
    "type": "personal",
    "participants": [
      "pierre-bezukhov",
      "helene-kuragina",
      "vasily-kuragin"
    ],
    "summary": "Пьер под давлением светского общества и семьи Курагиных женится на красавице Элен. Брак оказывается несчастливым с самого начала из-за безнравственности Элен и духовной незрелости Пьера.",
    "quotes": [
      "Пьер Безухов, очарованный красотой Элен Курагиной, сделал ей предложение.",
      "Элен приняла предложение, но их брак оказался несчастливым с самого начала.",
      "Пьер скоро понял, что Элен не любит его и интересуется только его состоянием.",
      "Их брак был полон скандалов и измен, что приводило Пьера в отчаяние.",
      "Пьер понимал, что женитьба на Элен будет ошибкой, но не мог решиться на смелый поступок и обмануть ожидания всей семьи Курагиных."
    ],
    "significance": "Важный этап духовных поисков Пьера. Показывает развращенность светского общества. Становится причиной дуэли с Долоховым и последующего духовного кризиса Пьера.",
    "textLink": "2.1.12"
  },
  {
    "id": "natasha-and-pierre-meeting",
    "title": "Встреча Наташи Ростовой и Пьера Безухова после войны",
    "date": "1812-12-01",
    "placeId": "moscow",
    "type": "personal",
    "participants": [
      "natasha-rostova",
      "pierre-bezukhov"
    ],
    "summary": "После всех испытаний войны Пьер возвращается в Москву и встречает Наташу, изменившуюся после смерти Андрея и Пети. Между ними возникает глубокая духовная связь.",
    "quotes": [
      "Наташа Ростова, увидев Пьера после войны, почувствовала, что ее сердце забилось чаще.",
      "Пьер, увидев Наташу, понял, что его чувства к ней стали глубже и серьезнее.",
      "Они говорили о прошлом, о войне, о своих надеждах и мечтах.",
      "Наташа сказала: 'Я всегда знала, что ты особенный, Пьер.'",
      "Пьер ответил: 'И я всегда знал, что ты — та, которую я ищу.'"
    ],
    "significance": "Кульминация духовных поисков обоих героев. Показывает обретение настоящего счастья через страдания и испытания. Становится началом их будущей семейной жизни.",
    "textLink": "4.4.16"
  },
  {
    "id": "duel-with-pierre",
    "title": "Дуэль Пьера Безухова с Долоховым",
    "date": "1806-06-01",
    "placeId": "st-petersburg",
    "type": "duel",
    "participants": [
      "pierre-bezukhov",
      "fedor-dolokhov"
    ],
    "summary": "Пьер вызывает Долохова на дуэль после открытой измены Элен. Неопытный в оружии Пьер ранит Долохова, что приводит к глубокому моральному кризису.",
    "quotes": [
      "Пьер, узнав об измене Элен с Долоховым, почувствовал, что его честь оскорблена.",
      "Он вызвал Долохова на дуэль, несмотря на то, что никогда раньше не участвовал в таких поединках.",
      "На дуэли Пьер был ранен, но это было не только физическое ранение, но и моральный кризис.",
      "Пьер понял, что его жизнь изменилась, и он должен найти новый смысл.",
      "Пьер раскаивался в происшедшем и благодарил Бога, что не убил Долохова."
    ],
    "significance": "Переломный момент в жизни Пьера. Заставляет его переосмыслить ценности и начать духовные поиски. Показывает абсурдность светских понятий о 'чести'.",
    "textLink": "2.1.10"
  },
  {
    "id": "hunt-in-otradnoye",
    "title": "Охота в Отрадном",
    "date": "1806-09-01",
    "placeId": "otradnoye",
    "type": "social",
    "participants": [
      "natasha-rostova",
      "nikolai-rostov",
      "andrei-bolkonsky"
    ],
    "summary": "Семейная охота Ростовых в их имении Отрадное. Андрей Болконский, гостящий у Ростовых, впервые по-настоящему замечает жизнерадостную Наташу.",
    "quotes": [
      "Охота в Отрадном была веселым мероприятием, где собрались друзья и семья Ростовых.",
      "Андрей Болконский, приехавший в гости, впервые по-настоящему заметил Наташу Ростову.",
      "Наташа, молодая и живая, сразу привлекла внимание Андрея своей искренностью и красотой.",
      "Андрей почувствовал, что между ними есть особая связь, которую он не мог объяснить.",
      "Дядюшке не нравилось, что на охоту взяли детей — Наташу и Петю."
    ],
    "significance": "Начало отношений между Андреем и Наташей. Показывает естественность и простоту жизни Ростовых в противовес искусственности светского общества.",
    "textLink": "2.3.1"
  },
  {
    "id": "ball-in-st-petersburg",
    "title": "Бал в Петербурге",
    "date": "1810-01-01",
    "placeId": "st-petersburg",
    "type": "ball",
    "participants": [
      "natasha-rostova",
      "andrei-bolkonsky",
      "helene-kuragina"
    ],
    "summary": "Первый выход Наташи Ростовой в свет на большом балу. Андрей Болконский приглашает ее на танец, что знаменует начало их романа.",
    "quotes": [
      "Бал в Петербурге был роскошным мероприятием, где собрались самые знатные семьи.",
      "Наташа Ростова, в своем первом бальном платье, была очаровательна и привлекала внимание всех присутствующих.",
      "Андрей Болконский, увидев Наташу, почувствовал, что его сердце забилось чаще.",
      "Они танцевали вместе, и Андрей сказал: 'Вы сегодня прекрасны, мадемуазель.'",
      "Наташа ответила: 'Благодарю вас, князь. Я очень рада видеть вас здесь.'"
    ],
    "significance": "Решающий момент в развитии отношений Наташи и Андрея. Символизирует вхождение Наташи во взрослую жизнь. Показывает контраст между естественной красотой Наташи и искусственной красотой Элен.",
    "textLink": "2.3.14"
  },
  {
    "id": "retreat-from-moscow",
    "title": "Отступление французской армии из Москвы",
    "date": "1812-10-19",
    "placeId": "moscow",
    "type": "military",
    "participants": [
      "pierre-bezukhov",
      "napoleon-bonaparte",
      "mikhail-kutuzov",
      "nikolai-rostov"
    ],
    "summary": "Начало катастрофического отступления наполеоновской армии из России. Французы страдают от голода, холода и постоянных атак партизан.",
    "quotes": [
      "Отступление французов из Москвы было хаотичным и жестоким.",
      "Наполеон, понимая, что его армия разгромлена, отдал приказ об отступлении.",
      "Пьер Безухов, наблюдая за отступлением, почувствовал, что война наконец подходит к концу.",
      "Русские войска преследовали французов, нанося им тяжелые потери.",
      "Отступление из Москвы стало началом конца для Наполеона и его армии."
    ],
    "significance": "Кульминация поражения Наполеона в России. Показывает народный характер войны и стратегическую мудрость Кутузова. Символизирует крах наполеоновской империи.",
    "textLink": "4.3.18"
  },
  {
    "id": "partisan-war",
    "title": "Партизанская война",
    "date": "1812-10-01",
    "placeId": "smolensk",
    "type": "war",
    "participants": [
      "denisov",
      "petya-rostov",
      "fedor-dolokhov",
      "mikhail-kutuzov"
    ],
    "summary": "Народная партизанская война против отступающей французской армии. Партизаны под руководством Денисова и Долохова наносят значительный урон врагу.",
    "quotes": [
      "Партизанская война была жестокой и беспощадной.",
      "Русские партизаны, вооруженные только вилами и топорами, сражались с французами.",
      "Денисов и Петя Ростов были среди тех, кто проявил особую храбрость в этих боях.",
      "Петя Ростов, молодой и полный энтузиазма, мечтал о славе и героизме.",
      "Партизанская война показала, что русские готовы сражаться за свою родину до последней капли крови."
    ],
    "significance": "Демонстрирует народный характер Отечественной войны. Показывает героизм простых людей. Гибель Пети Ростова становится одной из самых трагических сцен романа.",
    "textLink": "4.3.1"
  },
  {
    "id": "attempted-elopement-natasha",
    "title": "Попытка побега Наташи Ростовой с Анатолем Курагиным",
    "date": "1810-08-01",
    "placeId": "moscow",
    "type": "scandal",
    "participants": [
      "natasha-rostova",
      "anatole-kuragin"
    ],
    "summary": "Наташа, измученная годом ожидания Андрея, поддается ухаживаниям Анатоля Курагина и соглашается на побег. План раскрывается в последний момент.",
    "quotes": [
      "Наташа Ростова, поддавшись ухаживаниям Анатоля Курагина, решила сбежать с ним.",
      "Она написала письмо Андрею, в котором призналась в своей измене.",
      "Анатоль, однако, не был заинтересован в серьезных отношениях и бросил Наташу.",
      "Разрыв с Андреем был неизбежен, и Наташа почувствовала себя брошенной и виноватой.",
      "Это событие стало тяжелым ударом для Наташи, но она нашла в себе силы продолжить жить дальше."
    ],
    "significance": "Кризисный момент в жизни Наташи. Показывает ее неопытность и доверчивость. Становится важным этапом взросления и духовного роста героини.",
    "textLink": "2.5.15"
  }
]
