[
  {
    "id": "st-petersburg",
    "name": "Санкт‑Петербург", 
    "type": "город",
    "lat": 59.9386,
    "lng": 30.3141,
    "description": "Столица Российской империи, символ европеизации России и оторванности аристократии от народной жизни. Здесь происходят ключевые светские события, формируются политические интриги, проявляется искусственность высшего общества.",
    "historical_significance": "Центр политической и светской жизни России начала XIX века. Место принятия судьбоносных решений и одновременно символ отрыва власти от народа.",
    "quotes": [
      "В Петербурге, в высшем свете, шла сложная, напряженная борьба партий Румянцева, французов, Марии Федоровны, цесаревича и других, заглушаемая, как всегда, трубущей государя.",
      "Петербургский свет, собравшийся в большом театре, был однообразен: те же лица, те же разговоры.",
      "В Петербурге в это время происходила сложная борьба партий, более чем когда-нибудь озабоченных своими интересами."
    ],
    "key_events": ["soiree-anna-pavlovna", "ball-in-st-petersburg", "pierre-marriage-to-helene"],
    "heroes_associations": ["anna-scherer", "helene-kuragina", "vasily-kuragin", "pierre-bezukhov"],
    "symbolism": "Искусственность, политические интриги, отрыв от национальных корней",
    "textLinks": ["1.1.1", "1.2.3", "2.3.1"]
  },
  {
    "id": "austerlitz",
    "name": "Аустерлиц (Славков-у-Брна)",
    "type": "поле боя", 
    "lat": 49.1400,
    "lng": 16.8760,
    "description": "Место решающего сражения войны 1805 года, где объединенная русско-австрийская армия потерпела сокрушительное поражение от Наполеона. Для Андрея Болконского - место духовного перелома и переосмысления жизненных ценностей.",
    "historical_significance": "Одно из самых знаменитых сражений Наполеона, вошедшее в историю как 'битва трех императоров'. Показало военное превосходство французской армии и тактический гений Наполеона.",
    "quotes": [
      "Аустерлиц! Аустерлиц!.. — повторял князь Андрей.",
      "Над ним не было ничего уже, кроме неба, — высокого неба, не ясного, но все-таки неизмеримо высокого, с тихо ползущими по нем серыми облаками.",
      "Как тихо, спокойно и торжественно, совсем не так, как я бежал... совсем не так ползут эти облака по этому высокому бесконечному небу."
    ],
    "key_events": ["austerlitz-battle"],
    "heroes_associations": ["andrei-bolkonsky", "napoleon-bonaparte", "nikolai-rostov"],
    "symbolism": "Крах иллюзий, прозрение, встреча со смертью и вечностью", 
    "textLinks": ["1.3.16", "1.3.17", "1.3.18"]
  },
  {
    "id": "borodino",
    "name": "Бородино", 
    "type": "поле боя",
    "lat": 55.5290,
    "lng": 35.8160,
    "description": "Место генерального сражения Отечественной войны 1812 года, ставшее символом русского мужества и национального единства. Здесь решалась судьба России и завершился путь многих героев.",
    "historical_significance": "Крупнейшая битва Отечественной войны 1812 года, в которой русская армия под командованием Кутузова дала отпор войскам Наполеона. Хотя поле боя осталось за французами, моральная победа была на стороне русских.",
    "quotes": [
      "Бородинское сражение — это победа нравственная, та, которая убеждает врага в нравственном превосходстве своего противника.",
      "Прямым следствием Бородинского сражения было беспричинное бегство Наполеона из Москвы.",
      "Нравственная сила французской атакующей армии была истощена."
    ],
    "key_events": ["borodino-battle"],
    "heroes_associations": ["andrei-bolkonsky", "pierre-bezukhov", "mikhail-kutuzov", "napoleon-bonaparte", "nikolai-rostov"],
    "symbolism": "Народное единство, жертвенность, нравственная победа, исторический перелом",
    "textLinks": ["3.2.19", "3.2.20", "3.2.21"]
  },
  {
    "id": "moscow",
    "name": "Москва",
    "type": "город",
    "lat": 55.7558,
    "lng": 37.6176,
    "description": "Сердце России, символ национального духа и народной жизни. В ходе войны Москва становится жертвой, но именно через эту жертву происходит духовное возрождение и победа.",
    "historical_significance": "Древняя столица России, духовный и культурный центр. Оставление Москвы французам стало стратегическим ходом Кутузова, а пожар Москвы - символом народного сопротивления.",
    "quotes": [
      "Москва, Москва, матушка!..",
      "Москва должна быть оставлена. Войска отступают, оставьте Москву.",
      "Москва пуста... Как муравейник, разоренный кем-то, кишит муравьями в разных направлениях."
    ],
    "key_events": ["moscow-fire", "retreat-from-moscow", "natasha-and-pierre-meeting"],
    "heroes_associations": ["pierre-bezukhov", "natasha-rostova", "napoleon-bonaparte", "mikhail-kutuzov"],
    "symbolism": "Душа России, жертвенность, народное единство, возрождение через страдание",
    "textLinks": ["3.3.1", "3.3.2", "4.4.1"]
  },
  {
    "id": "smolensk",
    "name": "Смоленск",
    "type": "город", 
    "lat": 54.7826,
    "lng": 32.0452,
    "description": "Город на пути наполеоновской армии к Москве, место одного из первых серьезных сражений Отечественной войны 1812 года. Символизирует начало народной войны.",
    "historical_significance": "Ключевой оборонительный пункт на пути к Москве. Сражение под Смоленском показало ожесточенное сопротивление русских войск.",
    "quotes": [
      "Смоленск был оставлен. Это было необходимо.",
      "В Смоленске князь Андрей нашел полный разгар военных действий.",
      "Смоленск горел. Это было страшное зрелище."
    ],
    "key_events": ["partisan-war"],
    "heroes_associations": ["andrei-bolkonsky", "nikolai-rostov"],
    "symbolism": "Начало народного сопротивления, жертвенность, переход к тотальной войне",
    "textLinks": ["3.1.1", "3.1.2"]
  },
  {
    "id": "vilna",
    "name": "Вильна (Вильнюс)", 
    "type": "город",
    "lat": 54.6872,
    "lng": 25.2798,
    "description": "Место начала и окончания войны 1812 года для наполеоновской армии. Символизирует начало великого похода и его бесславный конец.",
    "historical_significance": "Город, откуда началось вторжение Наполеона в Россию и куда вернулись остатки его армии после поражения.",
    "quotes": [
      "Из Вильны выступила великая армия Наполеона.",
      "В Вильну вернулись жалкие остатки великой армии.",
      "Вильна была свидетельницей и начала, и конца великой трагедии."
    ],
    "key_events": ["retreat-from-moscow"],
    "heroes_associations": ["napoleon-bonaparte", "mikhail-kutuzov"],
    "symbolism": "Начало и конец, тщеславие и поражение, историческая справедливость",
    "textLinks": ["3.1.1", "4.4.15"]
  },
  {
    "id": "dresden",
    "name": "Дрезден",
    "type": "город",
    "lat": 51.0504, 
    "lng": 13.7373,
    "description": "Место встречи монархов перед началом войны 1812 года, символ политических интриг и амбиций европейских правителей.",
    "historical_significance": "Город, где Наполеон проводил смотр своих войск и союзников перед началом Русской кампании.",
    "quotes": [
      "В Дрездене собрались монархи Европы.",
      "Наполеон в Дрездене был на вершине своего могущества.",
      "Дрезденские торжества были последним аккордом перед великой трагедией."
    ],
    "key_events": [],
    "heroes_associations": ["napoleon-bonaparte"],
    "symbolism": "Политические амбиции, временное величие, преддверие катастрофы",
    "textLinks": ["3.1.1"]
  }
]