[
    {
      "id": "1.1.1",
      "title": "Вечер у Анны Павловны Шерер",
      "text": "– Eh bien, mon prince. Gênes et Lucques ne sont plus que des apanages, des поместья, de la famille Buonaparte. Non, je vous préviens que si vous ne me dites pas que nous avons la guerre, si vous vous permettez encore de pallier toutes les infamies, toutes les atrocités de cet Antichrist (ma parole, j'y crois) – je ne vous connais plus, vous n'êtes plus mon ami, vous n'êtes plus мой верный раб, comme vous dites. Ну, здравствуйте, здравствуйте. Je vois que je vous fais peur, садитесь и рассказывайте.\n\nТак говорила в июле 1805 года известная Анна Павловна Шерер, фрейлина и приближенная императрицы Марии Феодоровны, встречая важного и чиновного князя Василия, первого приехавшего на ее вечер. Анна Павловна кашляла несколько дней, у нее был _грипп,_ как она говорила _(грипп_ был тогда новое слово, употреблявшееся только редкими). В записочках, разосланных утром с красным лакеем, было написано без различия во всех:\n\n«Si vous n'avez rien de mieux à faire, Monsieur le comte (или mon prince), et si la perspective de passer la soirée chez une pauvre malade ne vous effraye pas trop, je serai charmée de vous voir chez moi entre 7 et 10 heures. _Annette Scherer»_\n\nОн говорил на том изысканном французском языке, на котором не только говорили, но и думали наши деды, и с теми тихими, покровительственными интонациями, которые свойственны состаревшемуся в свете и при дворе значительному человеку. Он подошел к Анне Павловне, поцеловал ее руку, подставив ей свою надушенную и сияющую лысину, и покойно уселся на диване.\n\n– Как можно быть здоровой… когда нравственно страдаешь? Разве можно, имея чувство, оставаться спокойною в наше время? – сказала Анна Павловна. – Вы весь вечер у меня, надеюсь?",
      "type": "event",
      "eventId": "soiree-anna-pavlovna",
      "heroes": ["pierre-bezukhov", "andrei-bolkonsky", "anna-scherer", "helene-kuragina", "vasily-kuragin"],
      "volume": 1,
      "chapter": 1,
      "section": 1,
      "page": 5
    },
    {
      "id": "1.1.2",
      "title": "Пьер Безухов в салоне",
      "text": "Вскоре после маленькой княгини вошел массивный, толстый молодой человек с стриженою головой, в очках, светлых панталонах по тогдашней моде, с высоким жабо и в коричневом фраке. Этот толстый молодой человек был незаконный сын знаменитого екатерининского вельможи, графа Безухова, умиравшего теперь в Москве. Он нигде не служил еще, только что приехал из-за границы, где он воспитывался, и был первый раз в обществе. Анна Павловна приветствовала его поклоном, относящимся к людям самой низшей иерархии в ее салоне. Но, несмотря на это низшее по своему сорту приветствие, при виде вошедшего Пьера в лице Анны Павловны изобразилось беспокойство и страх, подобный тому, который выражается при виде чего-нибудь слишком огромного и несвойственного месту. Хотя действительно Пьер был несколько больше других мужчин в комнате, но этот страх мог относиться только к тому умному и вместе робкому, наблюдательному и естественному взгляду, отличавшему его от всех в этой гостиной.\n\n– C'est bien aimable à vous, monsieur Pierre, d'être venu voir une pauvre malade, – сказала ему Анна Павловна, испуганно переглядываясь с тетушкой, к которой она подводила его. Пьер пробурлил что-то непонятное и продолжал отыскивать что-то глазами. Он радостно, весело улыбнулся, кланяясь маленькой княгине, как близкой знакомой, и подошел к тетушке. Страх Анны Павловны был не напрасен, потому что Пьер, не дослушав речи тетушки о здоровье ее величества, отошел от нее. Анна Павловна испуганно остановила его словами:\n\n– Вы не знаете аббата Морио? Он очень интересный человек… – сказала она.\n\n– Да, я слышал про его план вечного мира, и это очень интересно, но едва ли возможно…\n\n– Вы думаете?.. – сказала Анна Павловна, чтобы сказать что-нибудь и вновь обратиться к своим занятиям хозяйки дома, но Пьер сделал обратную неучтивость. Прежде он, не дослушав слов собеседницы, ушел; теперь он остановил своим разговором собеседницу, которой нужно было от него уйти. Он, нагнув голову и расставив большие ноги, начал доказывать Анне Павловне, почему он полагал, что план аббата был химера.",
      "type": "character",
      "eventId": "soiree-anna-pavlovna",
      "heroes": ["pierre-bezukhov"],
      "volume": 1,
      "chapter": 1,
      "section": 2,
      "page": 15
    },
    {
      "id": "1.1.3",
      "title": "Князь Андрей Болконский",
      "text": "Андрей Болконский, маленький, худощавый человек с острыми чертами лица, был также на вечере. Он сидел рядом с Анной Павловной и слушал ее рассказы. В его глазах читалась усталость от светской жизни и жажда настоящего дела, настоящего подвига, который изменил бы его судьбу.",
      "type": "character",
      "eventId": "soiree-anna-pavlovna",
      "heroes": ["andrei-bolkonsky"],
      "volume": 1,
      "chapter": 1,
      "section": 3,
      "page": 18
    },
    {
      "id": "1.1.4",
      "title": "Элен Курагина",
      "text": "Элен Курагина, блистательная красавица петербургского света, привлекала всеобщее внимание своей изысканной внешностью и уверенными манерами. Ее холодная красота и расчетливое поведение скрывали глубокую безнравственность, которая впоследствии станет причиной многих трагедий.",
      "type": "character",
      "eventId": "soiree-anna-pavlovna",
      "heroes": ["helene-kuragina"],
      "volume": 1,
      "chapter": 1,
      "section": 4,
      "page": 25
    },
    {
      "id": "1.1.7",
      "title": "Семья Ростовых",
      "text": "В доме Ростовых царила совершенно иная атмосфера - теплая, живая, наполненная искренними чувствами и радушием. Граф Илья Андреевич, его супруга и дети создавали тот уютный семейный мир, который так контрастировал с холодным блеском светских салонов.",
      "type": "family",
      "heroes": ["ilya-rostov", "natalya-rostova-senior", "natasha-rostova", "nikolai-rostov", "vera-rostova", "sonya"],
      "volume": 1,
      "chapter": 1,
      "section": 7,
      "page": 35
    },
    {
      "id": "1.1.16",
      "title": "Графиня Ростова",
      "text": "Графиня Наталья Ростова, мать семейства, воплощала в себе все лучшие черты русской дворянки - заботливую мать, верную супругу, радушную хозяйку. Ее материнская любовь и переживания за детей составляли основу ее характера.",
      "type": "character",
      "heroes": ["natalya-rostova-senior"],
      "volume": 1,
      "chapter": 1,
      "section": 16,
      "page": 48
    },
    {
      "id": "1.1.17",
      "title": "Вера Ростова",
      "text": "Вера, старшая дочь Ростовых, отличалась холодной рассудительностью и строгостью, которые резко контрастировали с живым и непосредственным характером ее младшей сестры Наташи. Ее практицизм часто вступал в противоречие с эмоциональностью других членов семьи.",
      "type": "character",
      "heroes": ["vera-rostova"],
      "volume": 1,
      "chapter": 1,
      "section": 17,
      "page": 50
    },
    {
      "id": "1.1.18",
      "title": "Соня",
      "text": "Соня, бедная родственница Ростовых, была воплощением самоотверженной любви и преданности. Ее тихая, жертвенная любовь к Николаю составляла всю ее жизнь, хотя она понимала, что их брак невозможен из-за ее бедности.",
      "type": "character",
      "heroes": ["sonya"],
      "volume": 1,
      "chapter": 1,
      "section": 18,
      "page": 52
    },
    {
      "id": "1.1.20",
      "title": "Князь Василий Курагин",
      "text": "Князь Василий Курагин, опытный царедворец и интриган, всегда мыслил категориями выгоды и расчета. Его циничное отношение к жизни и людям делало его типичным представителем разложившейся аристократии.",
      "type": "character",
      "heroes": ["vasily-kuragin"],
      "volume": 1,
      "chapter": 1,
      "section": 20,
      "page": 55
    },
    {
      "id": "1.1.21",
      "title": "Интриги Курагиных",
      "text": "Семья Курагиных представляла собой сплетение интриг, расчетов и безнравственности. Князь Василий и его дети - Элен, Анатоль и Ипполит - использовали любые средства для достижения своих целей, не гнушаясь обманом и предательством.",
      "type": "family",
      "heroes": ["vasily-kuragin", "helene-kuragina", "anatole-kuragin"],
      "volume": 1,
      "chapter": 1,
      "section": 21,
      "page": 57
    },
    {
      "id": "1.1.22",
      "title": "Княжна Марья",
      "text": "Княжна Марья Болконская, с ее глубокой религиозностью и душевной чистотой, представляла совершенно иной тип русской женщины. Ее жизнь в Лысых Горах под строгим надзором отца сформировала характер, сочетающий смирение с внутренней силой.",
      "type": "character",
      "heroes": ["maria-bolkonskaya"],
      "volume": 1,
      "chapter": 1,
      "section": 22,
      "page": 59
    },
    {
      "id": "1.1.23",
      "title": "Старый князь Болконский",
      "text": "Николай Андреевич Болконский, старый князь, воплощал в себе патриархальные устои старой России. Его строгость, педантичность и требовательность скрывали глубокую любовь к детям и преданность долгу.",
      "type": "character",
      "heroes": ["nikolai-bolkonsky"],
      "volume": 1,
      "chapter": 1,
      "section": 23,
      "page": 61
    },
    {
      "id": "1.1.25",
      "title": "Жизнь в Лысых Горах",
      "text": "Лысые Горы, имение Болконских, представляли собой мир строгого порядка и дисциплины. Распорядок дня, установленный старым князем, геометрическая точность аллей сада - все здесь подчинялось разуму и воле хозяина.",
      "type": "location",
      "heroes": ["nikolai-bolkonsky", "maria-bolkonskaya", "andrei-bolkonsky"],
      "volume": 1,
      "chapter": 1,
      "section": 25,
      "page": 65
    },
    {
      "id": "1.2.6",
      "title": "Долохов",
      "text": "Федор Долохов, офицер Семеновского полка, сочетал в себе отчаянную храбрость с циничным отношением к жизни. Его дуэль с Пьером стала следствием сложных отношений в светском обществе и личных амбиций.",
      "type": "character",
      "eventId": "duel-with-pierre",
      "heroes": ["fedor-dolokhov", "pierre-bezukhov"],
      "volume": 1,
      "chapter": 2,
      "section": 6,
      "page": 85
    },
    {
      "id": "1.2.15",
      "title": "Шенграбенское сражение",
      "text": "Шенграбенское сражение стало первым серьезным испытанием для многих героев романа. Здесь проявился истинный характер русских солдат и офицеров, их мужество и готовность к самопожертвованию.",
      "type": "battle",
      "heroes": ["andrei-bolkonsky", "nikolai-rostov", "tushin"],
      "volume": 1,
      "chapter": 2,
      "section": 15,
      "page": 105
    },
    {
      "id": "1.2.16",
      "title": "Подвиг Тушина",
      "text": "Капитан Тушин, неприметный артиллерийский офицер, проявил невероятное мужество и героизм в Шенграбенском сражении. Его батарея успешно сдерживала наступление французов, хотя сам капитан выглядел растерянным и неуверенным.",
      "type": "battle",
      "heroes": ["tushin", "andrei-bolkonsky"],
      "volume": 1,
      "chapter": 2,
      "section": 16,
      "page": 108
    },
    {
      "id": "1.2.17",
      "title": "После боя",
      "text": "После сражения, на военном совете, истинная ценность подвига Тушина была оценена по достоинству. Андрей Болконский защитил скромного капитана, понимая, что именно такие люди, а не честолюбивые карьериры, составляют силу русской армии.",
      "type": "battle",
      "heroes": ["tushin", "andrei-bolkonsky"],
      "volume": 1,
      "chapter": 2,
      "section": 17,
      "page": 110
    },
    {
      "id": "1.3.16",
      "title": "Аустерлицкое сражение",
      "text": "Аустерлицкое сражение стало переломным моментом в жизни Андрея Болконского. Мечтавший о славе и своем 'Тулоне', он столкнулся с жестокой реальностью войны, далекой от романтических представлений.",
      "type": "battle",
      "eventId": "austerlitz-battle",
      "heroes": ["andrei-bolkonsky", "napoleon-bonaparte"],
      "volume": 1,
      "chapter": 3,
      "section": 16,
      "page": 150
    },
    {
      "id": "1.3.17",
      "title": "Ранение князя Андрея",
      "text": "Раненый на поле боя под Аустерлицем, князь Андрей переживает глубокий духовный перелом. Лежа под высоким небом, он осознает ничтожность своих честолюбивых устремлений и тщетность военной славы.",
      "type": "battle",
      "eventId": "austerlitz-battle",
      "heroes": ["andrei-bolkonsky"],
      "volume": 1,
      "chapter": 3,
      "section": 17,
      "page": 152
    },
    {
      "id": "1.3.18",
      "title": "Небо Аустерлица",
      "text": "Над ним не было ничего уже, кроме неба, — высокого неба, не ясного, но все-таки неизмеримо высокого, с тихо ползущими по нем серыми облаками. «Как тихо, спокойно и торжественно, совсем не так, как я бежал, — подумал князь Андрей, — не так, как мы бежали, кричали и дрались; совсем не так, как с озлобленными и испуганными лицами тащили орудие француз и ядра, — совсем не так ползут облака по этому высокому бесконечному небу. Как же я не видал прежде этого высокого неба? И как я счастлив, что узнал его наконец. Да! все пустое, все обман, кроме этого бесконечного неба.»",
      "type": "battle",
      "eventId": "austerlitz-battle",
      "heroes": ["andrei-bolkonsky"],
      "volume": 1,
      "chapter": 3,
      "section": 18,
      "page": 155
    },
    {
      "id": "1.3.19",
      "title": "Наполеон на поле боя",
      "text": "Наполеон, объезжая поле боя после Аустерлицкого сражения, увидел раненого князя Андрея. Встреча с человеком, которого он считал своим кумиром, завершила процесс переоценки ценностей для Болконского - теперь Наполеон казался ему маленьким и ничтожным.",
      "type": "battle",
      "eventId": "austerlitz-battle",
      "heroes": ["napoleon-bonaparte", "andrei-bolkonsky"],
      "volume": 1,
      "chapter": 3,
      "section": 19,
      "page": 158
    },
    {
      "id": "2.1.10",
      "title": "Дуэль Пьера с Долоховым",
      "text": "Дуэль Пьера Безухова с Федором Долоховым стала следствием открытой измены Элен. Неопытный в оружии Пьер, к удивлению всех, ранил Долохова, что привело к глубокому моральному кризису обоих участников поединка.",
      "type": "duel",
      "eventId": "duel-with-pierre",
      "heroes": ["pierre-bezukhov", "fedor-dolokhov", "helene-kuragina"],
      "volume": 2,
      "chapter": 1,
      "section": 10,
      "page": 210
    },
    {
      "id": "2.1.12",
      "title": "Соня и Николай",
      "text": "Отношения Сони и Николая Ростова представляли собой драму самоотверженной любви. Соня, понимая невозможность их брака из-за своего бедственного положения, тем не менее оставалась верной своим чувствам.",
      "type": "personal",
      "heroes": ["sonya", "nikolai-rostov"],
      "volume": 2,
      "chapter": 1,
      "section": 12,
      "page": 215
    },
    {
      "id": "2.1.15",
      "title": "Николай Ростов в отпуске",
      "text": "Вернувшись домой в отпуск, Николай Ростов снова окунулся в теплую атмосферу семьи. Однако финансовые трудности отца и собственные карточные долги заставляли его задуматься о серьезности жизненных проблем.",
      "type": "personal",
      "heroes": ["nikolai-rostov", "ilya-rostov"],
      "volume": 2,
      "chapter": 1,
      "section": 15,
      "page": 220
    },
    {
      "id": "2.2.1",
      "title": "Пьер и масоны",
      "text": "После дуэли и разрыва с Элен Пьер Безухов искал смысл жизни и нашел его в масонстве. Идеи самосовершенствования, братства и служения человечеству на время увлекли его, дав надежду на духовное возрождение.",
      "type": "philosophical",
      "heroes": ["pierre-bezukhov"],
      "volume": 2,
      "chapter": 2,
      "section": 1,
      "page": 235
    },
    {
      "id": "2.3.1",
      "title": "Князь Андрей в Отрадном",
      "text": "Посещение имения Ростовых Отрадное стало для князя Андрея моментом духовного пробуждения. После пережитого под Аустерлицем он впервые почувствовал вкус к жизни, увидев в Наташе воплощение естественной красоты и радости бытия.",
      "type": "personal",
      "eventId": "hunt-in-otradnoye",
      "heroes": ["andrei-bolkonsky", "natasha-rostova"],
      "volume": 2,
      "chapter": 3,
      "section": 1,
      "page": 250
    },
    {
      "id": "2.3.2",
      "title": "Ночь в Отрадном",
      "text": "Ночь, проведенная в Отрадном, стала для князя Андрея моментом глубокого внутреннего перелома. Подслушанный разговор Наташи с Соней о красоте ночи пробудил в нем давно забытые чувства и надежды на счастье.",
      "type": "personal",
      "eventId": "hunt-in-otradnoye",
      "heroes": ["andrei-bolkonsky", "natasha-rostova", "sonya"],
      "volume": 2,
      "chapter": 3,
      "section": 2,
      "page": 252
    },
    {
      "id": "2.3.3",
      "title": "Встреча с Наташей",
      "text": "Утренняя встреча с Наташей окончательно убедила князя Андрея в том, что он может начать жизнь заново. Ее живая, естественная красота и искренность стали для него символом возрождения и надежды на простое человеческое счастье.",
      "type": "personal",
      "eventId": "hunt-in-otradnoye",
      "heroes": ["andrei-bolkonsky", "natasha-rostova"],
      "volume": 2,
      "chapter": 3,
      "section": 3,
      "page": 254
    },
    {
      "id": "2.3.5",
      "title": "Княжна Марья",
      "text": "Жизнь княжны Марьи в Лысых Горах продолжала течь в привычном русле, однако посещение Анатоля Курагина внесло смятение в ее душу. Искушение возможностью семейного счастья боролось в ней с чувством долга и преданности отцу.",
      "type": "personal",
      "heroes": ["maria-bolkonskaya", "anatole-kuragin"],
      "volume": 2,
      "chapter": 3,
      "section": 5,
      "page": 258
    },
    {
      "id": "2.3.8",
      "title": "Князь Василий в Лысых Горах",
      "text": "Визит князя Василия Курагина в Лысые Горы с сыном Анатолем был частью тщательно спланированной интриги. Расчетливый отец надеялся выгодно женить беспутного сына на богатой наследнице княжне Марье.",
      "type": "personal",
      "heroes": ["vasily-kuragin", "maria-bolkonskaya", "anatole-kuragin", "nikolai-bolkonsky"],
      "volume": 2,
      "chapter": 3,
      "section": 8,
      "page": 265
    },
    {
      "id": "2.3.9",
      "title": "Анатоль и Марья",
      "text": "Анатоль Курагин, красивый и харизматичный повеса, произвел сильное впечатление на неискушенную княжну Марью. Однако его истинная натура, скрытая за внешним лоском, вскоре проявилась и развеяла ее иллюзии.",
      "type": "personal",
      "heroes": ["anatole-kuragin", "maria-bolkonskaya"],
      "volume": 2,
      "chapter": 3,
      "section": 9,
      "page": 267
    },
    {
      "id": "2.3.10",
      "title": "Вера Ростова",
      "text": "Вера Ростова, в отличие от своей эмоциональной сестры, всегда руководствовалась рассудком и практическими соображениями. Ее замужество с Бергом стало логичным завершением ее прагматичного подхода к жизни.",
      "type": "personal",
      "heroes": ["vera-rostova"],
      "volume": 2,
      "chapter": 3,
      "section": 10,
      "page": 270
    },
    {
      "id": "2.3.12",
      "title": "Элен и Пьер",
      "text": "Отношения Пьера с Элен окончательно разладились. Безнравственность жены и ее открытые измены заставляли Пьера все больше погружаться в себя, искать утешение в философских размышлениях и масонских идеях.",
      "type": "personal",
      "heroes": ["helene-kuragina", "pierre-bezukhov"],
      "volume": 2,
      "chapter": 3,
      "section": 12,
      "page": 275
    },
    {
      "id": "2.3.14",
      "title": "Первый бал Наташи",
      "text": "Первый бал Наташи Ростовой стал важнейшим событием в ее жизни. Ее естественная красота и искренняя радость привлекли внимание всех присутствующих, а танец с князем Андреем положил начало их роману.",
      "type": "event",
      "eventId": "ball-in-st-petersburg",
      "heroes": ["natasha-rostova", "andrei-bolkonsky", "helene-kuragina"],
      "volume": 2,
      "chapter": 3,
      "section": 14,
      "page": 280
    },
    {
      "id": "2.5.1",
      "title": "Старый князь Болконский",
      "text": "Старый князь Болконский, чувствуя приближение смерти, стал еще более требовательным и деспотичным. Его сложные отношения с детьми, особенно с дочерью Марьей, достигали в этот период особой напряженности.",
      "type": "character",
      "heroes": ["nikolai-bolkonsky", "maria-bolkonskaya"],
      "volume": 2,
      "chapter": 5,
      "section": 1,
      "page": 310
    },
    {
      "id": "2.5.6",
      "title": "Элен и её общество",
      "text": "Элен Курагина, став признанной красавицей петербургского света, создала вокруг себя блестящее общество. Ее салон стал местом, где собирались самые влиятельные и модные люди столицы, а ее романы и интриги были предметом общих пересудов.",
      "type": "social",
      "heroes": ["helene-kuragina"],
      "volume": 2,
      "chapter": 5,
      "section": 6,
      "page": 320
    },
    {
      "id": "2.5.9",
      "title": "Графиня Ростова",
      "text": "Графиня Ростова с материнской тревогой наблюдала за взрослением дочери. Ее беспокоили и роман Наташи с князем Андреем, и финансовые трудности семьи, которые с каждым днем становились все серьезнее.",
      "type": "character",
      "heroes": ["natalya-rostova-senior", "natasha-rostova"],
      "volume": 2,
      "chapter": 5,
      "section": 9,
      "page": 325
    },
    {
      "id": "2.5.15",
      "title": "Попытка побега Наташи с Анатолем",
      "text": "Попытка побега Наташи с Анатолем Курагиным стала кульминацией ее душевного смятения. Измученная годом ожидания Андрея, молодая и неопытная девушка поддалась чарам красивого соблазнителя, не понимая истинных последствий своего поступка.",
      "type": "scandal",
      "eventId": "attempted-elopement-natasha",
      "heroes": ["natasha-rostova", "anatole-kuragin"],
      "volume": 2,
      "chapter": 5,
      "section": 15,
      "page": 335
    },
    {
      "id": "3.1.1",
      "title": "Начало войны 1812 года",
      "text": "Война 1812 года началась как противостояние двух великих армий, но очень быстро превратилась в народную, отечественную войну. Вторжение Наполеона в Россию пробудило в русском народе силы, которые до того времени дремали.",
      "type": "historical",
      "heroes": ["napoleon-bonaparte", "alexander-i", "mikhail-kutuzov"],
      "volume": 3,
      "chapter": 1,
      "section": 1,
      "page": 350
    },
    {
      "id": "3.1.2",
      "title": "Смоленск",
      "text": "Падение Смоленска стало тяжелым ударом для России, но именно здесь начал проявляться народный характер войны. Жители города добровольно сжигали свои дома, чтобы ничего не досталось врагу, демонстрируя готовность к самопожертвованию.",
      "type": "battle",
      "heroes": ["andrei-bolkonsky", "nikolai-rostov"],
      "volume": 3,
      "chapter": 1,
      "section": 2,
      "page": 352
    },
    {
      "id": "3.1.9",
      "title": "Николай Ростов на войне",
      "text": "Николай Ростов, пройдя через испытания предыдущих кампаний, стал опытным офицером. Его патриотизм и преданность долгу сочетались теперь с трезвым пониманием ужасов войны и ответственности за подчиненных.",
      "type": "military",
      "heroes": ["nikolai-rostov"],
      "volume": 3,
      "chapter": 1,
      "section": 9,
      "page": 365
    },
    {
      "id": "3.1.17",
      "title": "Наташа в Москве",
      "text": "Наташа Ростова, пережившая тяжелый разрыв с Андреем и попытку побега с Анатолем, нашла утешение в заботе о раненых. Ее естественная жизнерадостность уступила место глубокой душевной работе и состраданию.",
      "type": "personal",
      "heroes": ["natasha-rostova"],
      "volume": 3,
      "chapter": 1,
      "section": 17,
      "page": 380
    },
    {
      "id": "3.1.18",
      "title": "Анатоль Курагин",
      "text": "Анатоль Курагин, продолжавший вести разгульную жизнь, оказался вовлечен в военные события. Его легкомыслие и эгоизм контрастировали с серьезностью момента, когда решалась судьба России.",
      "type": "character",
      "heroes": ["anatole-kuragin"],
      "volume": 3,
      "chapter": 1,
      "section": 18,
      "page": 382
    },
    {
      "id": "3.1.21",
      "title": "Петя Ростов",
      "text": "Петя Ростов, самый младший в семье, рвался на войну с юношеским энтузиазмом и романтическими представлениями о подвигах. Его неопытность и доверчивость вызывали одновременно умиление и тревогу у старших.",
      "type": "character",
      "heroes": ["petya-rostov"],
      "volume": 3,
      "chapter": 1,
      "section": 21,
      "page": 388
    },
    {
      "id": "3.2.8",
      "title": "Княжна Марья и старый князь",
      "text": "Отношения княжны Марьи с умирающим отцем достигли особой напряженности. Суровый старый князь, чувствуя приближение конца, стал еще более требовательным, но в его сердце пробивались давно скрываемые нежные чувства к дочери.",
      "type": "personal",
      "heroes": ["maria-bolkonskaya", "nikolai-bolkonsky"],
      "volume": 3,
      "chapter": 2,
      "section": 8,
      "page": 405
    },
    {
      "id": "3.2.16",
      "title": "Кутузов",
      "text": "Михаил Илларионович Кутузов, назначенный главнокомандующим, воплощал в себе народную мудрость и понимание духа русской армии. Его кажущаяся пассивность на самом деле была глубоко продуманной стратегией, основанной на знании характера войны.",
      "type": "character",
      "heroes": ["mikhail-kutuzov"],
      "volume": 3,
      "chapter": 2,
      "section": 16,
      "page": 420
    },
    {
      "id": "3.2.19",
      "title": "Бородинское сражение",
      "text": "Бородинское сражение стало кульминацией Отечественной войны 1812 года. Здесь сошлись в решающей битве две великие армии, а судьба России висела на волоске. Каждый солдат понимал значимость этого момента.",
      "type": "battle",
      "eventId": "borodino-battle",
      "heroes": ["andrei-bolkonsky", "pierre-bezukhov", "napoleon-bonaparte", "mikhail-kutuzov"],
      "volume": 3,
      "chapter": 2,
      "section": 19,
      "page": 425
    },
    {
      "id": "3.2.20",
      "title": "Батарея Раевского",
      "text": "Батарея Раевского стала одним из ключевых пунктов Бородинского сражения. Именно здесь происходили самые ожесточенные бои, а Пьер Безухов, оказавшийся волонтером на поле боя, впервые столкнулся с настоящим ужасом войны.",
      "type": "battle",
      "eventId": "borodino-battle",
      "heroes": ["pierre-bezukhov"],
      "volume": 3,
      "chapter": 2,
      "section": 20,
      "page": 428
    },
    {
      "id": "3.2.21",
      "title": "Пьер на Бородинском поле",
      "text": "Пьер Безухов, оказавшись на Бородинском поле, пережил глубокое духовное потрясение. Наблюдая за сражением, он понял, что война - это не парад и не игра, а страшная реальность, где решаются судьбы народов.",
      "type": "battle",
      "eventId": "borodino-battle",
      "heroes": ["pierre-bezukhov"],
      "volume": 3,
      "chapter": 2,
      "section": 21,
      "page": 430
    },
    {
      "id": "3.2.25",
      "title": "Ранение князя Андрея",
      "text": "Смертельное ранение князя Андрея под Бородино стало завершением его жизненного пути. Встретившись лицом к лицу со смертью, он обрел то высшее прозрение, которого искал всю жизнь, поняв, что любовь есть сама жизнь.",
      "type": "battle",
      "eventId": "borodino-battle",
      "heroes": ["andrei-bolkonsky"],
      "volume": 3,
      "chapter": 2,
      "section": 25,
      "page": 438
    },
    {
      "id": "3.2.26",
      "title": "Наполеон при Бородино",
      "text": "Наполеон во время Бородинского сражения впервые столкнулся с армией, которая сражалась не по правилам европейской военной науки. Упорство и самопожертвование русских солдат заставили его усомниться в неизбежности победы.",
      "type": "battle",
      "eventId": "borodino-battle",
      "heroes": ["napoleon-bonaparte"],
      "volume": 3,
      "chapter": 2,
      "section": 26,
      "page": 440
    },
    {
      "id": "3.3.1",
      "title": "Совет в Филях",
      "text": "Совет в Филях стал одним из самых драматических моментов войны. Кутузов, взяв на себя огромную ответственность, принял решение оставить Москву, понимая, что это необходимо для сохранения армии и ultimate победы.",
      "type": "military",
      "heroes": ["mikhail-kutuzov"],
      "volume": 3,
      "chapter": 3,
      "section": 1,
      "page": 450
    },
    {
      "id": "3.3.2",
      "title": "Оставление Москвы",
      "text": "Оставление Москвы русской армией стало шоком для современников, но было стратегически верным решением. Город, оставленный жителями, стал ловушкой для наполеоновской армии, лишенной продовольствия и крова.",
      "type": "historical",
      "heroes": ["mikhail-kutuzov"],
      "volume": 3,
      "chapter": 3,
      "section": 2,
      "page": 452
    },
    {
      "id": "3.3.4",
      "title": "Кутузов принимает решение",
      "text": "Момент принятия Кутузовым решения об оставлении Москвы показал его величие как полководца и мудрость как человека. Он понимал, что иногда нужно отступить, чтобы победить, и был готов взять на себя ответственность за этот тяжелый выбор.",
      "type": "military",
      "heroes": ["mikhail-kutuzov"],
      "volume": 3,
      "chapter": 3,
      "section": 4,
      "page": 455
    },
    {
      "id": "3.3.9",
      "title": "Пьер в Москве",
      "text": "Пьер Безухов, оставшись в оставленной жителями Москве, переживал глубокий духовный кризис. Его решение остаться в городе было продиктовано желанием найти свой путь и понять смысл происходящих событий.",
      "type": "personal",
      "eventId": "moscow-fire",
      "heroes": ["pierre-bezukhov"],
      "volume": 3,
      "chapter": 3,
      "section": 9,
      "page": 465
    },
    {
      "id": "3.3.14",
      "title": "Семья Ростовых",
      "text": "Семья Ростовых, как и тысячи других москвичей, покидала родной город. Их отъезд символизировал общенародный характер войны, когда личные судьбы переплетались с судьбой страны.",
      "type": "family",
      "heroes": ["ilya-rostov", "natalya-rostova-senior", "natasha-rostova", "sonya", "petya-rostov"],
      "volume": 3,
      "chapter": 3,
      "section": 14,
      "page": 475
    },
    {
      "id": "4.1.5",
      "title": "Соня",
      "text": "Соня, всегда остававшаяся в тени, продолжала свою жертвенную любовь к Николаю. Ее решение отпустить его, освободив от данного обещания, стало высшим проявлением ее самоотверженности и истинной любви.",
      "type": "character",
      "heroes": ["sonya", "nikolai-rostov"],
      "volume": 4,
      "chapter": 1,
      "section": 5,
      "page": 490
    },
    {
      "id": "4.1.10",
      "title": "Княжна Марья и Николай",
      "text": "Встреча княжны Марьи и Николая Ростова в тяжелые военные годы стала для обоих откровением. Их отношения, начавшиеся с взаимной помощи и поддержки, постепенно переросли в глубокое чувство, основанное на духовной близости.",
      "type": "personal",
      "heroes": ["maria-bolkonskaya", "nikolai-rostov"],
      "volume": 4,
      "chapter": 1,
      "section": 10,
      "page": 500
    },
    {
      "id": "4.1.11",
      "title": "Пьер в плену",
      "text": "Попав в плен к французам, Пьер Безухов оказался в условиях, максимально далеких от его прежней жизни. Лишенный привычного комфорта и статуса, он начал по-новому понимать ценность простых вещей и человеческих отношений.",
      "type": "personal",
      "heroes": ["pierre-bezukhov"],
      "volume": 4,
      "chapter": 1,
      "section": 11,
      "page": 502
    },
    {
      "id": "4.1.12",
      "title": "Встреча с Платоном Каратаевым",
      "text": "Встреча с Платоном Каратаевым стала для Пьера Безухова настоящим откровением. Простой солдат научил его народной мудрости - принимать жизнь такой, какая она есть, любить людей и верить в высшую справедливость.",
      "type": "philosophical",
      "heroes": ["pierre-bezukhov", "platon-karatayev"],
      "volume": 4,
      "chapter": 1,
      "section": 12,
      "page": 505
    },
    {
      "id": "4.1.13",
      "title": "Философия Каратаева",
      "text": "Философия Платона Каратаева, основанная на смирении, принятии судьбы и любви ко всему живому, оказала глубокое влияние на Пьера. Его простые поговорки и рассказы содержали вековую мудрость русского народа.",
      "type": "philosophical",
      "heroes": ["platon-karatayev", "pierre-bezukhov"],
      "volume": 4,
      "chapter": 1,
      "section": 13,
      "page": 508
    },
    {
      "id": "4.1.14",
      "title": "Николай Ростов",
      "text": "Николай Ростов, пройдя через все испытания войны, стал зрелым человеком и ответственным офицером. Его патриотизм теперь сочетался с пониманием жизни и готовностью взять на себя заботу о семье.",
      "type": "character",
      "heroes": ["nikolai-rostov"],
      "volume": 4,
      "chapter": 1,
      "section": 14,
      "page": 510
    },
    {
      "id": "4.1.16",
      "title": "Смерть Пети Ростова",
      "text": "Гибель Пети Ростова стала одной из самых трагических потерь для семьи Ростовых. Юный, полный жизни и надежд, он пал в первом же серьезном бою, символизируя собой все невинные жертвы войны.",
      "type": "tragedy",
      "heroes": ["petya-rostov", "natasha-rostova", "nikolai-rostov", "ilya-rostov", "natalya-rostova-senior"],
      "volume": 4,
      "chapter": 1,
      "section": 16,
      "page": 515
    },
    {
      "id": "4.3.1",
      "title": "Партизанская война",
      "text": "Партизанская война стала проявлением истинно народного характера Отечественной войны 1812 года. Простые крестьяне, вооруженные вилами и топорами, наносили значительный урон отступающей французской армии.",
      "type": "war",
      "eventId": "partisan-war",
      "heroes": ["denisov", "fedor-dolokhov", "petya-rostov"],
      "volume": 4,
      "chapter": 3,
      "section": 1,
      "page": 530
    },
    {
      "id": "4.3.5",
      "title": "Долохов в партизанах",
      "text": "Федор Долохов, нашедший себя в партизанской войне, проявил не только свою обычную храбрость, но и незаурядные командирские способности. Его отряд стал одним из самых эффективных в борьбе с отступающим врагом.",
      "type": "war",
      "eventId": "partisan-war",
      "heroes": ["fedor-dolokhov"],
      "volume": 4,
      "chapter": 3,
      "section": 5,
      "page": 538
    },
    {
      "id": "4.3.6",
      "title": "Денисов",
      "text": "Василий Денисов, командуя партизанским отрядом, сочетал в себе опыт регулярного офицера с пониманием специфики народной войны. Его храбрость и преданность родине вдохновляли подчиненных.",
      "type": "war",
      "eventId": "partisan-war",
      "heroes": ["denisov"],
      "volume": 4,
      "chapter": 3,
      "section": 6,
      "page": 540
    },
    {
      "id": "4.3.10",
      "title": "Гибель Пети Ростова",
      "text": "Гибель Пети Ростова во время партизанской вылазки стала символом трагедии войны, уносящей самых молодых и полных жизни. Его смерть подчеркнула жестокость войны, не щадящей даже детей.",
      "type": "tragedy",
      "eventId": "partisan-war",
      "heroes": ["petya-rostov", "denisov"],
      "volume": 4,
      "chapter": 3,
      "section": 10,
      "page": 548
    },
    {
      "id": "4.3.11",
      "title": "Реакция на смерть Пети",
      "text": "Известие о гибели Пети стало тяжелейшим ударом для семьи Ростовых. Особенно сильно переживала Наташа, которая в эти дни сама ухаживала за умирающим Андреем и понимала всю хрупкость человеческой жизни.",
      "type": "tragedy",
      "heroes": ["natasha-rostova", "ilya-rostov", "natalya-rostova-senior", "nikolai-rostov"],
      "volume": 4,
      "chapter": 3,
      "section": 11,
      "page": 550
    },
    {
      "id": "4.3.18",
      "title": "Отступление Наполеона",
      "text": "Отступление наполеоновской армии из России превратилось в катастрофу. Голод, холод и постоянные атаки партизан довершили разгром великой армии, которая казалась непобедимой при своем вступлении в Россию.",
      "type": "military",
      "eventId": "retreat-from-moscow",
      "heroes": ["napoleon-bonaparte"],
      "volume": 4,
      "chapter": 3,
      "section": 18,
      "page": 565
    },
    {
      "id": "4.4.1",
      "title": "Возвращение в Москву",
      "text": "Возвращение жителей в Москву после изгнания французов символизировало возрождение жизни после разрухи. Город, переживший пожар и оккупацию, постепенно возвращался к нормальной жизни.",
      "type": "historical",
      "heroes": ["natasha-rostova", "pierre-bezukhov"],
      "volume": 4,
      "chapter": 4,
      "section": 1,
      "page": 570
    },
    {
      "id": "4.4.5",
      "title": "Кутузов",
      "text": "Кутузов, доведший войну до победного конца, понимал, что его миссия выполнена. Его мудрость проявилась и в том, что он не стремился к личной славе, а думал о благе России и ее народа.",
      "type": "character",
      "heroes": ["mikhail-kutuzov"],
      "volume": 4,
      "chapter": 4,
      "section": 5,
      "page": 578
    },
    {
      "id": "4.4.7",
      "title": "Народная война",
      "text": "Отечественная война 1812 года показала, что истинная сила России - в ее народе. Именно народное сопротивление, а не только усилия регулярной армии, привело к разгрому наполеоновского нашествия.",
      "type": "philosophical",
      "heroes": ["mikhail-kutuzov"],
      "volume": 4,
      "chapter": 4,
      "section": 7,
      "page": 582
    },
    {
      "id": "4.4.12",
      "title": "Пьер после плена",
      "text": "Пьер Безухов, вышедший из плена, был уже другим человеком. Он сбросил с себя все наносное, искусственное и обрел ту простоту и ясность взгляда на жизнь, которые составляют основу настоящего счастья.",
      "type": "character",
      "heroes": ["pierre-bezukhov"],
      "volume": 4,
      "chapter": 4,
      "section": 12,
      "page": 592
    },
    {
      "id": "4.4.15",
      "title": "Конец войны",
      "text": "Окончание войны принесло России не только победу, но и глубокие внутренние изменения. Страна, пережившая нашествие и изгнавшая врага, обрела новое самосознание и уверенность в своих силах.",
      "type": "historical",
      "heroes": ["alexander-i", "mikhail-kutuzov"],
      "volume": 4,
      "chapter": 4,
      "section": 15,
      "page": 598
    },
    {
      "id": "4.4.16",
      "title": "Встреча Пьера и Наташи",
      "text": "Встреча Пьера и Наташи после всех испытаний войны стала для обоих откровением. Их чувства, пройдя через страдания и лишения, обрели глубину и серьезность, став основой для настоящей, прочной любви.",
      "type": "personal",
      "eventId": "natasha-and-pierre-meeting",
      "heroes": ["pierre-bezukhov", "natasha-rostova"],
      "volume": 4,
      "chapter": 4,
      "section": 16,
      "page": 600
    },
    {
      "id": "E.1.1",
      "title": "Эпилог, часть 1",
      "text": "Эпилог подводит итоги жизненных путей главных героев после окончания войны. Семьи Безуховых и Ростовых, переплетаясь браками, создают новую патриархальную Россию, основанную на традиционных ценностях и простом человеческом счастье.",
      "type": "epilogue",
      "heroes": ["pierre-bezukhov", "natasha-rostova", "nikolai-rostov", "maria-bolkonskaya"],
      "volume": "E",
      "chapter": 1,
      "section": 1,
      "page": 610
    },
    {
      "id": "E.1.2",
      "title": "Семьи Безуховых и Ростовых",
      "text": "Семьи Безуховых и Ростовых, объединенные браками Пьера с Наташей и Николая с Марьей, представляют собой новый тип русского дворянства - просвещенного, но сохранившего народные корни и традиционные семейные устои.",
      "type": "family",
      "heroes": ["pierre-bezukhov", "natasha-rostova", "nikolai-rostov", "maria-bolkonskaya"],
      "volume": "E",
      "chapter": 1,
      "section": 2,
      "page": 615
    },
    {
      "id": "E.2.1",
      "title": "Эпилог, часть 2",
      "text": "Вторая часть эпилога посвящена философским размышлениям Толстого о движущих силах истории. Автор развивает свою теорию, согласно которой исторические события определяются не волей отдельных личностей, а сложным переплетением множества факторов и народной воли.",
      "type": "philosophical",
      "heroes": [],
      "volume": "E",
      "chapter": 2,
      "section": 1,
      "page": 625
    },
    {
      "id": "E.2.3",
      "title": "Философские размышления",
      "text": "Философские размышления Толстого в эпилоге завершают идейную концепцию романа. Автор утверждает идею предопределенности исторических событий и критикует представление о 'великих людях' как творцах истории, отстаивая значение народных масс в историческом процессе.",
      "type": "philosophical",
      "heroes": [],
      "volume": "E",
      "chapter": 2,
      "section": 3,
      "page": 630
    }
]
