[
  {
    "id": "war-and-peace",
    "title": "Война и мир",
    "summary": "Фундаментальное противопоставление и взаимопроникновение военной и мирной жизни как двух состояний человеческого бытия.",
    "description": "Толстой показывает войну не как череду сражений, а как трагическое состояние, обнажающее истинную природу человека. Мирная жизнь представлена не просто как отсутствие войны, но как сложная система человеческих отношений, нравственных исканий и духовного роста. Оба состояния взаимопроникают: в мирной жизни есть свои 'битвы', а на войне проявляются 'мирные' человеческие качества.",
    "quotes": [
      "Война — противное человеческому разуму и всей человеческой природе событие.",
      "Цель войны — убийство, орудия войны — шпионство, измена и поощрение ее, разорение жителей, ограбление их или воровство для продовольствия армии; обман и ложь, называемые военными хитростями.",
      "Мир — это не просто отсутствие войны, но состояние гармонии и понимания между людьми."
    ],
    "philosophical_aspects": [
      "Всегда ли наши ожидания соответствуют реальности?",
      "Как страх влияет на человека?",
      "Зачем надо извлекать уроки из поражений и побед на войне?",
      "Что помогает победить на войне?",
      "Что объединяет людей в годы войны?",
      "Кто способен проявить сострадание, милосердие к пленному врагу?",
      "Проблема нравственной оценки факта войны"
    ],
    "arguments": [
      {
        "aspect": "Всегда ли наши ожидания соответствуют реальности?",
        "quotes": [
          "Война — противное человеческому разуму и всей человеческой природе событие."
        ],
        "examples": [
          "Андрей Болконский, отправляясь сражаться с Наполеоном в Европу, представлял себе войну местом средоточия доблести, героизма, храбрости, красоты. Однако при первом боевом столкновении с французами Болконский видит 'непарадную' сторону войны. Войска пытаются переправиться через мост под градом снарядов, кругом царит хаос, бегут солдаты, кричат раненные. Представления Болконского о войне полностью меняются, он понимает, что война лишена красоты и романтики, она преисполнена жестокости и крови."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Как страх влияет на человека?",
        "quotes": [],
        "examples": [
          "Офицер Жерков проявляет себя как человек, не готовый жертвовать собой ради победы. Во время Шенграбенского сражения он проявляет трусость, которая приводит к гибели множества солдат. По приказу Багратиона он должен отправиться на левый фланг с очень важным посланием - приказом отступать. Однако Жерков трусит и не передает послание. В это время на левый фланг нападают французы, и начальство не знает, что делать, ведь они не получали никаких приказов. Начинается хаос: пехота убегает в лес, а гусары идут в атаку. Из-за действий Жеркова погибает огромное количество солдат."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Зачем надо извлекать уроки из поражений и побед на войне?",
        "quotes": [],
        "examples": [
          "Андрей Болконский шел на войну с намерениями построить блестящую военную карьеру. Он оставил свою семью, чтобы получить славу в сражениях. Как горько было его разочарование, когда он понял, что проиграл в этой битве. То, что представлялось ему в мечтах как прекрасные батальные сцены, в жизни оказалось страшной бойней с кровью и человеческими страданиями. Осознание пришло к нему как прозрение, он понял, что война страшна, и она не несет в себе ничего, кроме боли. Это личное поражение на войне заставило его переоценить свою жизнь и признать, что семья, дружба и любовь намного важнее славы и признания."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Что помогает победить на войне?",
        "quotes": [
          "Дубина народной войны поднялась со всей своей грозной и величественной силой..."
        ],
        "examples": [
          "Невозможно одержать победу в войне в одиночку. Только сплотившись перед лицом общей беды и найдя в себе храбрость противостоять страху, можно победить. Разные люди объединились в борьбе за жизнь и свободу. Храбрость каждого солдата, боевой дух армии и вера в собственные силы помогли русским победить французскую армию. Побеждают в этой войне не карьеристы, которые хотят лишь чинов и наград, а обычные солдаты, крестьяне, ополченцы, ежеминутно совершающие подвиг. Скромный командир батареи Тушин, Тихон Щербатый и Платон Каратаев, купец Ферапонтов, юный Петя Ростов, объединяющие в себе основные качества русского народа, сражались не потому что им приказали, они сражались по своей воле, защищали свой дом и своих близких, именно поэтому победили в войне."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Что объединяет людей в годы войны?",
        "quotes": [],
        "examples": [
          "Люди разных сословий и взглядов сплотились перед лицом общей беды. Единение народа показано писателем на примере множества непохожих индивидуальностей. Так, семья Ростовых оставляет в Москве все свое имущество и отдает подводы раненым. Купец Феропонтов призывает солдат грабить свою лавку, чтобы врагу ничего не досталось. Пьер Безухов переодевается и остается в Москве, намереваясь убить Наполеона. Капитан Тушин и Тимохин с героизмом исполняют свой долг. В стремлении победить врага, защитить близких и выжить люди чувствуют свое родство особенно сильно. Объединившись и почувствовав братство, народ смог сплотиться и победить неприятеля."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Кто способен проявить сострадание, милосердие к пленному врагу?",
        "quotes": [],
        "examples": [
          "Проявить сострадание к врагу способны только сильные люди, знающие цену человеческой жизни. В ночном лесу рота солдат грелась у костра. Неожиданно они услышали шорох и увидели двух французских солдат, несмотря на военное время не побоявшихся подойти к врагу. Они были очень слабы и еле держались на ногах. Солдаты постелили больному шинель и принесли обоим каши и водки. Это были офицер Рамбаль и его денщик Морель. Офицер так замерз, что не мог даже передвигаться, поэтому русские солдаты взяли его на руки и отнесли в избу. Эта история учит нас тому, что даже в трудные времена нужно оставаться человеком, не добивать слабого, проявлять сострадание и милосердие."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Проблема нравственной оценки факта войны",
        "quotes": [
          "Война — противное человеческому разуму и всей человеческой природе событие."
        ],
        "examples": [
          "Человеку, столкнувшемуся с ужасами войны трудно понять, зачем она нужна. Пьер Безухов не участвует в сражениях, однако пытается всеми силами помочь своему народу. Он не осознает истинного ужаса войны, пока не становится свидетелем Бородинской битвы. Видя бойню, граф ужасается ее бесчеловечности. Он попадает в плен, испытывает физические и душевные мучения, пытается постичь природу войны, но не может. Пьер не в состоянии самостоятельно справиться с душевным кризисом, и только его встреча с Платоном Каратаевым помогает ему понять, что счастье заключается не в победе или поражении, а в простых человеческих радостях. Война, с его точки зрения, негуманна и противоестественна."
        ],
        "essay_argument": ""
      }
    ],
    "heroes": [
      "pierre-bezukhov",
      "andrei-bolkonsky",
      "natasha-rostova",
      "nikolai-rostov",
      "mikhail-kutuzov",
      "napoleon-bonaparte",
      "denisov",
      "petya-rostov"
    ],
    "events": [
      "austerlitz-battle",
      "borodino-battle",
      "moscow-fire",
      "partisan-war",
      "retreat-from-moscow",
      "rostovs-evacuation",
      "petya-death"
    ],
    "textLinks": ["1.1.1", "3.2.1", "4.4.15"]
  },
  {
    "id": "freedom-and-necessity",
    "title": "Свобода и необходимость",
    "summary": "Диалектика личной воли и исторической предопределённости в судьбах отдельных людей и народов.",
    "description": "Толстой развивает концепцию 'роевой жизни': исторические события определяются не волей отдельных личностей, а совокупностью миллионов человеческих воль. Наполеон и Кутузов представлены как противоположные типы исторических деятелей: один пытается навязать свою волю истории, другой — следует её естественному течению.",
    "quotes": [
      "Цари — рабы истории.",
      "Для историка (в смысле причины) существуют законы прогресса; для человеческого разума — свобода.",
      "Человек сознательно живёт для себя, но служит бессознательным орудием для достижения исторических целей человечества."
    ],
    "philosophical_aspects": [
      "Какова роль личности в истории?",
      "Как общество влияет на формирование целей?",
      "Что объединяет людей в годы войны?",
      "Можно ли сохранить достоинство в тяжелые времена?"
    ],
    "arguments": [
      {
        "aspect": "Какова роль личности в истории?",
        "quotes": [
          "Цари — рабы истории.",
          "Нет величия там, где нет простоты, добра и правды."
        ],
        "examples": [
          "Толстой приходит к выводу, что 'царь есть раб истории'. Современник Толстого историк Богданович прежде всего указывал на определяющую роль Александра Первого в победе над Наполеоном, а роль народа и Кутузова вообще сбрасывал со счета. Толстой же ставил своей задачей развенчать роль царей и показать роль народных масс и народного полководца Кутузова. Кутузов не может понять всемирно-исторического смысла войны 12-го года, но он осознает значение этого события для своего народа. Кутузов сам близок народу, он чувствует дух войска и может управлять этой великой силой. Наполеон лишен понимания происходящих событий, он – пешка в руках истории."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Как общество влияет на формирование целей?",
        "quotes": [],
        "examples": [
          "С самого начала повествования все помыслы Анны Михайловны и ее сына устремлены к одной цели – устроению своего материального благополучия. Поначалу Борис пытается сопротивляться воле матери, но со временем понимает, что законы общества, в котором они живут, подчиняются только одному правилу – прав тот, у кого власть и деньги. Борис принимается 'делать карьеру'. Его не увлекает служба Отечеству, он предпочитает службу в тех местах, где можно с минимальной отдачей быстро продвинуться по служебной лестнице. Для него не существует ни искренних чувств (отказ от Наташи), ни искренней дружбы."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Что объединяет людей в годы войны?",
        "quotes": [],
        "examples": [
          "Люди разных сословий и взглядов сплотились перед лицом общей беды. Единение народа показано писателем на примере множества непохожих индивидуальностей. Так, семья Ростовых оставляет в Москве все свое имущество и отдает подводы раненым. Купец Феропонтов призывает солдат грабить свою лавку, чтобы врагу ничего не досталось. Пьер Безухов переодевается и остается в Москве, намереваясь убить Наполеона. Капитан Тушин и Тимохин с героизмом исполняют свой долг. В стремлении победить врага, защитить близких и выжить люди чувствуют свое родство особенно сильно."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Можно ли сохранить достоинство в тяжелые времена?",
        "quotes": [],
        "examples": [
          "Семья Ростовых показала, что даже в самые тяжелые времени можно сохранить достоинство. Даже когда в стране наступил хаос, члены этой семьи остались верными своим моральным принципам. Они помогали солдатам, принимая их у себя дома. Тяготы жизни не отразились на их характерах."
        ],
        "essay_argument": ""
      }
    ],
    "heroes": [
      "pierre-bezukhov",
      "andrei-bolkonsky",
      "mikhail-kutuzov",
      "napoleon-bonaparte",
      "natasha-rostova"
    ],
    "events": [
      "austerlitz-battle",
      "borodino-battle",
      "retreat-from-moscow",
      "partisan-war",
      "natasha-and-andrei-engagement",
      "fili-council",
      "pierre-inheritance",
      "pierre-captivity"
    ],
    "textLinks": ["3.1.1", "4.1.1", "E.2.1"]
  },
  {
    "id": "family-and-love",
    "title": "Семья и любовь",
    "summary": "Семейные ценности как основа нравственного бытия человека и различные формы любви как пути духовного развития.",
    "description": "Толстой противопоставляет истинные семейные ценности (Ростовы, Болконские в конце романа) и ложные (Курагины). Любовь представлена в разных ипостасях: романтическая (Андрей и Наташа), страстная (Наташа и Анатоль), духовная (Пьер и Наташа), семейная (Ростовы, Болконские, Безуховы в эпилоге). Через любовь герои проходят путь нравственного взросления.",
    "quotes": [
      "Любовь? Что такое любовь? Любовь мешает смерти. Любовь есть жизнь.",
      "Любовь к женщине имеет в себе нечто эгоистическое, а семейная любовь, напротив, одухотворяет человека."
    ],
    "philosophical_aspects": [
      "Какие качества раскрывает в человеке любовь?",
      "Что значит быть верным близким?",
      "Почему люди изменяют?",
      "Как связано отсутствие моральных принципов с изменами?"
    ],
    "arguments": [
      {
        "aspect": "Какие качества раскрывает в человеке любовь?",
        "quotes": [
          "Любовь мешает смерти. Любовь есть жизнь."
        ],
        "examples": [
          "Марья свои лучшие качества раскрывает, переживая любовь. Через общение с Николаем Марья преображается несмотря на внешнюю некрасивость, неоднократно подчеркиваемую Толстым, становится прекрасной. Она более искренняя, более цельная, самостоятельная личность. Семейная жизнь Николая и Марьи обоим приносит счастье и покой, потому что супруги взаимно обогащают друг друга."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Что значит быть верным близким?",
        "quotes": [],
        "examples": [
          "Марья Болконская посвятила всю свою жизнь служению близким, в частности, своему отцу. Она терпела упреки в свой адрес, стойко переносила грубость отца. Когда армия противников наступала, она не оставила больного отца, не изменила себе. Интересы своих близких она ставила выше, чем собственные."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Почему люди изменяют?",
        "quotes": [],
        "examples": [
          "Наташа Ростова не смогла остаться верной Андрею Болконскому. Она изменила ему духовно с Анатолем Курагиным, даже хотела сбежать вместе с ним. На измену ее толкнули две причины: отсутствие житейской мудрости, неопытность, а также неуверенность в Андрее и ее будущем с ним. Уезжая на войну, Андрей не выяснил с ней личные дела, не дал ей уверенности в ее положении. Анатоль Курагин же, воспользовавшись неопытностью девушки, обольстил ее. Ростова, в силу своего возраста, не смогла подумать о последствиях своего выбора."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Как связано отсутствие моральных принципов с изменами?",
        "quotes": [],
        "examples": [
          "Элен Курагина в романе представлена как человек с отсутствием моральных принципов, потому и понятие верности ей чуждо. В жизни она руководствуется только выгодой, чувства других людей для нее ничего не значат. Выходя замуж за Пьера, она не осознавала, что может причинить ему боль, и думала только о материальной выгоде. Элен не любила Пьера и не хотела от него детей. Поэтому брак был обречен на гибель. Ее многочисленные измены не оставили шанса их союзу."
        ],
        "essay_argument": ""
      }
    ],
    "heroes": [
      "natasha-rostova",
      "pierre-bezukhov",
      "andrei-bolkonsky",
      "nikolai-rostov",
      "maria-bolkonskaya",
      "ilya-rostov",
      "sonya",
      "helene-kuragina"
    ],
    "events": [
      "ball-in-st-petersburg",
      "hunt-in-otradnoye",
      "natasha-and-andrei-engagement",
      "natasha-and-pierre-meeting",
      "pierre-marriage-to-helene",
      "attempted-elopement-natasha",
      "epilogue-marriages",
      "rostovs-evacuation",
      "natasha-and-andrei-reconciliation"
    ],
    "textLinks": ["2.3.1", "4.4.1", "E.1.1"]
  },
  {
    "id": "life-and-death",
    "title": "Жизнь и смерть",
    "summary": "Экзистенциальные вопросы бытия, поиск смысла жизни перед лицом смерти.",
    "description": "Герои Толстого постоянно сталкиваются с вопросами жизни и смерти. Андрей Болконский переживает экзистенциальный кризис после Аустерлица и перед смертью обретает высшую мудрость. Пьер Безухов ищет смысл жизни через масонство, плен, любовь. Смерть представлена не как конец, а как переход в иное состояние бытия.",
    "quotes": [
      "Смерть — пробуждение.",
      "Любовь есть Бог, и умереть — значит мне, частице любви, вернуться к общему и вечному источнику.",
      "Жизнь есть всё. Жизнь есть Бог. Всё перемещается и движется, и это движение есть Бог."
    ],
    "philosophical_aspects": [
      "В чем заключается смысл жизни?",
      "Поиск смысла жизни",
      "Страшно ли ошибаться? Для чего нужны ошибки?",
      "Можно ли сохранить достоинство в тяжелые времена?"
    ],
    "arguments": [
      {
        "aspect": "В чем заключается смысл жизни?",
        "quotes": [
          "Жизнь есть всё. Жизнь есть Бог. Всё перемещается и движется, и это движение есть Бог."
        ],
        "examples": [
          "Каждый человек живет во множестве миров, так проявляются связи отдельной личности с другими людьми, в семье, в обществе и т. д. Поиск смысла жизни героями Толстого сводится к постижению ими глубинных связей между людьми. Его любимым героям свойственно стремление обрести гармонию в общении с людьми. Все они в конечном итоге приходят к мысли о необходимости духовного единения людей (Андрей Болконский, Пьер Безухов). Это важнейший критерий нравственной оценки личности. Наиболее непосредственно к духовному единению приходят люди из народа, так как именно народ, по Толстому, является носителем духовных ценностей."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Поиск смысла жизни",
        "quotes": [],
        "examples": [
          "Андрей и Пьер совсем не похожи по типу личности, но их объединяет и делает близкими общее свойство – необходимость понимания жизни и своего места в ней. Для Болконского это выражено в стремлении воздействовать на ход событий личным деянием, подвигом. Для Пьера возможностью благоустройства становится идея самосовершенствования. Но умозрительные идеи не способны справиться с жизненным беспорядком. Их путь к истине становится движением к другим людям, и обретается человеческое единение не путем мысли, а путем интуитивного познания и опытом жизни с людьми. В 1812 г. князь Болконский будет не адъютантом главнокомандующего, но пойдет служить «в рядах», где для него станет понятным зависимость исхода событий от того «общего духа», который есть в нем, Кутузове, Тимохине и в последнем солдате. Для Пьера главными уроками жизни станет понимание «простоты и правды», которые он увидит в солдатах при Бородине, а потом видение той истинности общей народной жизни, которую он почувствует в Каратаева."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Страшно ли ошибаться? Для чего нужны ошибки?",
        "quotes": [],
        "examples": [
          "Ошибки очень важны, поскольку помогают человеку приобретать опыт, становиться лучше. Андрей Болконский в начале романа полон эгоизма и себялюбия, он мечтает о славе любой ценой, почитает своего кумира Наполеона. Но ранение под Аустерлицем, ясное осознание конечности жизни и бесконечности природы — всё это помогает осознать Андрею, как мелочны и ничтожны были его мечты. Труден будет его путь поиска истины: от разочарования в жизни до желания быть нужным всем. Через ошибки к пониманию высшего смысла жизни, который заключается в любви к близким, народу, стране — такой путь проходит герой Толстого."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Можно ли сохранить достоинство в тяжелые времена?",
        "quotes": [],
        "examples": [
          "Семья Ростовых показала, что даже в самые тяжелые времени можно сохранить достоинство. Даже когда в стране наступил хаос, члены этой семьи остались верными своим моральным принципам. Они помогали солдатам, принимая их у себя дома. Тяготы жизни не отразились на их характерах."
        ],
        "essay_argument": ""
      }
    ],
    "heroes": [
      "andrei-bolkonsky",
      "pierre-bezukhov",
      "natasha-rostova",
      "petya-rostov",
      "platon-karatayev"
    ],
    "events": [
      "austerlitz-battle",
      "borodino-battle",
      "moscow-fire",
      "partisan-war",
      "karataev-death",
      "petya-death",
      "liza-death",
      "natasha-and-andrei-reconciliation"
    ],
    "textLinks": ["1.3.16", "3.2.25", "4.1.16"]
  },
  {
    "id": "faith-and-reason",
    "title": "Вера и разум",
    "summary": "Противостояние и взаимодействие религиозного чувства и рационального познания в духовных исканиях героев.",
    "description": "Толстой показывает разные пути духовного поиска: рациональный (Андрей Болконский), религиозно-мистический (Пьер через масонство), народно-религиозный (Платон Каратаев), естественно-религиозный (Наташа Ростова, Марья). Истинная вера оказывается не в обрядах, а в простом человеческом чувстве любви и принятия.",
    "quotes": [
      "Бог есть там, где любовь.",
      "Вера есть понимание смысла жизни и признание вытекающих из этого понимания обязанностей.",
      "Жизнь есть всё. Жизнь есть Бог."
    ],
    "philosophical_aspects": [
      "Соотношение истинных и ложных ценностей",
      "Соотношение внешней и внутренней красоты",
      "Как воспитание влияет на человека?",
      "Какова роль личности в истории?",
      "Как общество влияет на формирование целей?",
      "Как связано отсутствие моральных принципов с изменами?",
      "Почему люди изменяют?"
    ],
    "arguments": [
      {
        "aspect": "Соотношение истинных и ложных ценностей",
        "quotes": [],
        "examples": [
          "В сценах частной жизни и в исторических сценах обнаруживается общий смысл. Кардинальная для Толстого мысль об истинных и ложных жизненных ценностях равно открывается Николаю Ростову после огромного карточного проигрыша, князю Андрею, лежащему после ранения на Праценской горе, Пьеру, наблюдающему за солдатами, идущими к Бородину перед сражением. Общность ситуации в том, что во всех трех случаях происходит решительный сдвиг – жизнь нарушает свое обычное течение перед лицом смерти – и тогда обычные и не вызывающие сомнений ценности обнаруживают свою ложность и в силу вступает настоящее и всеобщее в жизни."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Соотношение внешней и внутренней красоты",
        "quotes": [],
        "examples": [
          "Элен – единственная 'вполне красивая' женщина, описанная Толстым, однако это едва ли не самый непривлекательный образ в романе. В ее красоте нет возвышающего душу начала, она возбуждает 'гадкое чувство'. Элен исключительно беспринципна и эгоистична. Элен противопоставляется Толстым княжне Марье – Марья, несмотря на свою некрасивость, богата внутренне, Элен – блестяща внешне, но духовно уродлива. Элен неразвита и вульгарна, ее суждения примитивны. Элен 'проверяется' войной 12-го года, обнаруживая при этом собственное ничтожество."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Как воспитание влияет на человека?",
        "quotes": [],
        "examples": [
          "На примере семьи Ростовых Толстой описывает свой идеал семейного бытия, добрых отношений между членами семьи. Ростовы живут 'жизнью сердца', не требуя друг от друга особого ума, легко и непринужденно относясь к жизненным неурядицам. Им свойственно истинно русское стремление к широте и размаху. Всем членам семьи Ростовых свойственны живость и непосредственность. Члены семьи Курагиных связаны только внешними отношениями. У князя Василия нет отеческого чувства к детям, все Курагины разобщены. Курагины органично вписываются в общество завсегдатаев салона Шерер с его фальшью, искусственностью, лжепатриотизмом, интригами."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Какова роль личности в истории?",
        "quotes": [
          "Цари — рабы истории.",
          "Нет величия там, где нет простоты, добра и правды."
        ],
        "examples": [
          "Толстой приходит к выводу, что 'царь есть раб истории'. Толстой же ставил своей задачей развенчать роль царей и показать роль народных масс и народного полководца Кутузова. Кутузов не может понять всемирно-исторического смысла войны 12-го года, но он осознает значение этого события для своего народа. Кутузов сам близок народу, он чувствует дух войска и может управлять этой великой силой. Наполеон лишен понимания происходящих событий, он – пешка в руках истории. Образ Наполеона олицетворяет собой крайний индивидуализм и эгоизм."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Как общество влияет на формирование целей?",
        "quotes": [],
        "examples": [
          "С самого начала повествования все помыслы Анны Михайловны и ее сына устремлены к одной цели – устроению своего материального благополучия. Поначалу Борис пытается сопротивляться воле матери, но со временем понимает, что законы общества, в котором они живут, подчиняются только одному правилу – прав тот, у кого власть и деньги. Борис принимается 'делать карьеру'. Его не увлекает служба Отечеству, он предпочитает службу в тех местах, где можно с минимальной отдачей быстро продвинуться по служебной лестнице. Для него не существует ни искренних чувств (отказ от Наташи), ни искренней дружбы."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Как связано отсутствие моральных принципов с изменами?",
        "quotes": [],
        "examples": [
          "Элен Курагина в романе представлена как человек с отсутствием моральных принципов, потому и понятие верности ей чуждо. В жизни она руководствуется только выгодой, чувства других людей для нее ничего не значат. Выходя замуж за Пьера, она не осознавала, что может причинить ему боль, и думала только о материальной выгоде. Элен не любила Пьера и не хотела от него детей. Поэтому брак был обречен на гибель. Ее многочисленные измены не оставили шанса их союзу."
        ],
        "essay_argument": ""
      },
      {
        "aspect": "Почему люди изменяют?",
        "quotes": [],
        "examples": [
          "Наташа Ростова не смогла остаться верной Андрею Болконскому. Она изменила ему духовно с Анатолем Курагиным, даже хотела сбежать вместе с ним. На измену ее толкнули две причины: отсутствие житейской мудрости, неопытность, а также неуверенность в Андрее и ее будущем с ним. Уезжая на войну, Андрей не выяснил с ней личные дела, не дал ей уверенности в ее положении. Анатоль Курагин же, воспользовавшись неопытностью девушки, обольстил ее. Ростова, в силу своего возраста, не смогла подумать о последствиях своего выбора."
        ],
        "essay_argument": ""
      }
    ],
    "heroes": [
      "pierre-bezukhov",
      "andrei-bolkonsky",
      "natasha-rostova",
      "maria-bolkonskaya",
      "platon-karatayev"
    ],
    "events": [
      "austerlitz-battle",
      "borodino-battle",
      "moscow-fire",
      "pierre-marriage-to-helene",
      "pierre-masonry",
      "pierre-captivity",
      "karataev-death"
    ],
    "textLinks": ["2.2.1", "2.5.1", "4.1.11"]
  }
]